[
    {
        "idiom": "安然无恙",
        "pingyin": "ān rán wú yàng",
        "explanation": "原指人平安没有疾病。现泛指人或事物平安未遭损害。",
        "source": "《战国策·齐策四》",
        "memo": "《战国策·齐策四》：“齐王使使者问赵威后。书未发，威后问使者曰：‘岁亦无恙耶?民亦无恙耶?王亦无恙耶?’”",
        "story": "齐国国王派使者到赵国拜访执掌朝政的威后，书信还没有打开，太后就问使者说：“年景收成没有什么不妥吧?百姓没有什么不妥吧?国君没有什么不妥吧?”",
        "character": [
            "威后"
        ]
    },
    {
        "idiom": "白马非马",
        "pingyin": "bái mǎ fēi mǎ",
        "explanation": "赵国公孙龙提出“白马非马”的名辩命题，谓诡辩代表人物。",
        "source": "《公孙龙子·迹府》",
        "memo": "《公孙龙子·迹府》:“公孙龙，六国时辩士也。疾名实之散乱，因资材之所长，为‘守白’之论。假物取譬(音辟)以‘守白’辩，谓白马为非马也。白马为非马者，言白所以名色，言马所以名形也；色非形，形非色也。夫言色则形不当与，言形则色不宜从，今未何以为物，非也。”",
        "story": "战国时，赵国公孙龙提出“白马非马”的名辩命题。他认为白是形容颜色的，马是说明事物形体的；说颜色不当使形体参与，说形体不宜使颜色参与，若合而为一，则是不对的。此说虽注意了事物与概念，一般与个别的区别，在古代逻辑思想发展上有一定的贡献，但否认事物与属性的互相联系，导致违反客观事实的错误结论，陷入了唯心论泥淖。",
        "character": [
            "公孙龙"
        ]
    },
    {
        "idiom": "爱屋及乌",
        "pingyin": "ài wū jí wū",
        "explanation": "比喻爱一个人而连带地关心到与他有关的人或物。",
        "source": "《尚书大传·大战》",
        "memo": "《尚书大传·大战》：“爱人者，兼其屋上之乌。”",
        "story": "周武王打败了殷商，但是对于怎样处置商朝遗留下来的权臣贵族、官宦将士，能不能使局面稳定下来，心里还没有谱，因此有些担忧。为此，他曾同姜太公等商议。召见姜太公，问道：“该怎样对待他们的人员呢？”太公答道：“我听说，如果喜爱那个人，就连带喜爱他屋上的乌鸦；如果憎恨那个人，就连带夺来他的仆从家吏。全部杀尽敌对分子，让他们一个也不留，您看怎样？”",
        "character": [
            "周武王",
            "姜太公"
        ]
    },
    {
        "idiom": "安步当车",
        "pingyin": "ān bù dàng jū",
        "explanation": "形容轻松缓慢地行走。也指人能够安守贫贱生活。",
        "source": "《战国策·齐策四》",
        "memo": "《战国策·齐策四》：“晚食以当肉，安步以当车，无罪以当贵，清静贞正以自虞。”",
        "story": "”战国时期，齐国有位隐士名叫颜斶(chù)。齐宣王听说他很有名，就召见了他。颜斶进宫后，齐宣王傲慢地说：颜斶，你过来!颜斶不卑不亢地对齐宣王说：大王，你过来!齐宣王很不高兴，旁边的大臣也都责怪颜斶。颜斶便说：如果我走到大王面前去，说明我羡慕他的权势;如果大王走过来，说明他礼贤下士。与其让我羡慕大王的权势，还不如让大王礼贤下士的好。齐宣王恼怒地问他：到底是大王尊贵，还是士人尊贵?颜斶说：当然是士人尊贵!从前秦国进攻齐国的时候，秦王下令：谁敢在距离高士柳下惠坟墓五十步以内的地方砍柴，格杀勿论!另外还悬赏：谁能砍下齐王的脑袋，就封他为万户侯，赏金两万两。由此可见，一个活着的大王的头，还抵不上一个死去的士人坟墓呢。齐宣王觉得自己理亏了，便请求做颜斶的学生，并说：您和我在一起，食有美味，出必乘车，妻子儿女可以穿上华美的服装。颜斶毫不动心，坚决辞谢：我还是希望让我回去，每天晚点儿吃饭，也像吃肉那样香;慢慢地走路，就当是坐车一样;不犯罪过，就是保持自己的尊贵。清静无为，纯正自守，乐在其中啊!颜斶说罢，告辞而去。”",
        "character": [
            "颜斶",
            "齐宣王"
        ]
    },
    {
        "idiom": "拔苗助长",
        "pingyin": "bá miáo zhù zhǎng",
        "explanation": "比喻违反事物发展的客观规律，急于求成，反而坏事。",
        "source": "《孟子·公孙丑上》",
        "memo": "《孟子·公孙丑上》：天下之不助苗长者寡矣。以为无益而舍之者，不耘苗者也；助之长者，揠苗者也。非徒无益，而又害之。",
        "story": "古时候有个人，希望自己田里的禾苗长的快点，天天到田边去看。可是，一天、两天、三天，禾苗好像一点也没有长高。他就在田边焦急的转来转去，自言自语的说：“我得想个办法帮他们长。“一天，他终于想到了办法，就急忙跑到田里，把禾苗一棵一棵往高里拔。从中午一直忙到太阳落山，弄得精疲力尽。当他回到家里时，一边喘气一边对儿子说：“今天可把我累坏了，力气没白费，禾苗都长了一大截。” 他的儿子不明白是怎么回事，跑到田里一看，发现禾苗都枯死了。",
        "character": []
    },
    {
        "idiom": "百家争鸣",
        "pingyin": "bǎi jiā zhēng míng",
        "explanation": "指各种学术流派的自由争论互相批评。也指不同意见的争论。",
        "source": "《汉书·艺文志》",
        "memo": "东汉班固《汉书·艺文志》：“凡诸子百家，……蜂出并作，各引一端，崇其所善，以此驰说，联合诸侯。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "白虹贯日",
        "pingyin": "bái hóng guàn rì",
        "explanation": "形如白色的长虹穿日而过。",
        "source": "《战国策·魏策四》",
        "memo": "《战国策·魏策四》：“聂政之刺韩傀也，白虹贯日。”",
        "story": "战国时期，韩国大臣严遂与相国韩傀结下怨仇，他到齐国去找屠狗为业的聂政去刺杀韩傀。聂政待母亲去世后，为报答严遂的知遇之恩，就独身仗剑闯入戒备森严的韩傀府并刺杀了他，然后自我毁容自杀，传说当时有白色的长虹穿日而过。",
        "character": [
            "严遂",
            "韩傀"
        ]
    },
    {
        "idiom": "卜宅卜邻",
        "pingyin": "bǔ zhái bǔ lín",
        "explanation": "迁居时不是先在住宅方面占卜吉凶，而是占卜邻居是不是可以为邻。",
        "source": "《左传·昭公三年》",
        "memo": "《左传·昭公三年》：非宅是卜，唯邻是卜，二三子先卜邻矣，违卜不祥。",
        "story": "",
        "character": []
    },
    {
        "idiom": "卜昼卜夜",
        "pingyin": "bǔ zhòu bǔ yè",
        "explanation": "用以形容不分昼夜地饮酒作乐，没有节制的状态或行为",
        "source": "《左传·庄公二十二年》",
        "memo": "《左传·庄公二十二年》：“臣卜其昼，未卜其夜，不敢。”",
        "story": "”敬仲，即春秋时陈国的公子完，同陈宣公是兄弟。陈宣公为了叫宠姬所生的儿子款为太子，便把原来立为太子的大儿子御寇杀了。敬仲是站在御寇一边的，因此不能在陈国安身立足，便投奔齐国。齐桓公很恭敬地接待敬仲，拜他为“卿”。敬仲谦虚地说：“我是投奔贵国的客人，蒙您收留，让我在这里舒舒服服地住下，我已经非常感激了，怎敢高居卿位，让人笑我不知足呢！”齐桓公觉得他很懂道理，便改聘为“工正”，请他担任管理各种工匠的职务。但是对他的待遇，仍不同于一般官员。齐桓公经常找他谈天、游玩。有一次，齐桓公到敬仲家里去，敬仲拿出酒来招待他，桓公喝得很高兴，直到天快黑了，还叫点灯，要继续喝。敬仲婉言劝止，说道：“臣卜其昼，未卜其夜，不敢！（我只准备白天陪您玩，却没有打算继续到夜晚，恕我不敢久留您！）”由于这段故事，后来形容游宴无度，不计时间，从白昼到黑夜，又从黑夜到白昼，连续不休地玩乐，就叫“卜昼卜夜”。”",
        "character": [
            "敬仲",
            "齐桓公"
        ]
    },
    {
        "idiom": "不义之财",
        "pingyin": "bú yì zhī cái",
        "explanation": "不应该得到的或以不正当的手段获得的钱财",
        "source": "《列女传·齐田稷母传》",
        "memo": "汉·刘向《列女传·齐田稷母传》：“不义之财，非吾有也，不孝之子，非吾子也。”",
        "story": "古代齐国宰相田稷子把下官送给他的一些黄金孝敬给母亲，母亲觉得奇怪问他做了三年宰相就有这么多俸禄，难道就没有开销了？田稷子只好如实回答，其母告诫他作为士大夫应该修身养性，不能贪这些不义之财。田稷子立即把黄金一一退回",
        "character": [
            "田稷子"
        ]
    },
    {
        "idiom": "不翼而飞",
        "pingyin": "bú yì ér fēi",
        "explanation": "比喻东西突然不见了。也比喻事情传播得很迅速。",
        "source": "《战国策·秦策三》",
        "memo": "《战国策·秦策三》：“众口所移，毋翼而飞。”",
        "story": "”战国时，有一年秦王派大将王稽攻打赵国的都城邯郸，一连攻了十七个月，也攻不下城池。王稽非常烦恼，有个名叫庄的人向王稽献计说：“你如果犒赏部下，就可以鼓舞他们的斗志，邯郸攻破是有希望的。”王稽不耐烦地说：“我是统帅，只知道服从国王的命令，别的事情管不了那么多。”庄并没有被王稽的不耐烦而吓退，他继续说道：“你这样讲不太对。即使是父亲给儿子下命令，有的可行，有的就不可行。……我看你一味媚上欺下，独断专行，轻视士兵已经很久了。我听说，假如有三个人谎称老虎来了，那么听的人就会信以为真；如果有十个人合力弯一个木槌，就能把木槌弄弯；如果大家都口传消息，要求你改变指挥方法，这消息没有翅膀也会飞得很远。这说明众部下的力量是巨大的。因此，你还是赏赐一下你的将士们吧！”可是，王稽还是听不进庄的意见。几天之后秦军果然发生叛乱，严重地影响了战事的顺利进行，秦王很是恼怒，就把王稽处死了。”",
        "character": [
            "王稽"
        ]
    },
    {
        "idiom": "不经之谈",
        "pingyin": "bù jīng zhī tán",
        "explanation": "荒诞无稽、没有根据的话",
        "source": "《史记·孟子荀卿列传》",
        "memo": "西汉·司马迁《史记·孟子荀卿列传》：“其语闳大不经。”晋·羊祜《戒子书》：“无传无经之谈，无听毁誉之语。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "不知所措",
        "pingyin": "bù zhī suǒ cuò",
        "explanation": "意指不知道怎么办才好。",
        "source": "《管子·七臣七主》",
        "memo": "《管子·七臣七主》：“振主：喜怒无度，严诛无赦，臣下振恐，不知所措，则人反其故。不悟则法数日衰，而国失固。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "布衣之交",
        "pingyin": "bù yī zhī jiāo",
        "explanation": "平民之间的交往、友谊。也指显贵与无官职的人相交往。",
        "source": "《战国策·齐策三》",
        "memo": "西汉·刘向《战国策·齐策三》：“卫君与文布衣交，请具车马皮币，愿君以此从卫君游。鲍彪注：“言交于未贵时。",
        "story": "战国时期，齐国孟尝君没有杀一个与他的小妾相爱的门客，而是给他准备了许多礼物，把他推荐给卫国国君，对他说：“我们是布衣之交，希望卫国能给你伟大前程。”后来卫国准备联络其他诸侯去攻打齐国，该门客极力劝阻，避免了一场战争。",
        "character": [
            "孟尝君"
        ]
    },
    {
        "idiom": "秉笔直书",
        "pingyin": "bǐng bǐ zhí shū",
        "explanation": "指写文章不隐瞒、不夸大，真实地反映情况",
        "source": "《孽海花》",
        "memo": "清·曾朴《孽海花》第三十五回：“我是秉笔直书，悬之国门，不能增损一字。",
        "story": "",
        "character": []
    },
    {
        "idiom": "兵行诡道",
        "pingyin": "bīng xíng guǐ dào",
        "explanation": "用兵可以运用诡异和诈伪的战法。",
        "source": "《孙子·始计》",
        "memo": "《孙子·始计》：“兵者，诡道也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "兵车之会",
        "pingyin": "bīng chē zhī huì",
        "explanation": "春秋时齐桓公争霸，屡次与诸侯会盟",
        "source": "《公羊传·僖公二十一年》",
        "memo": "《公羊传·僖公二十一年》：“请君以兵车之会往宋。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "避实击虚",
        "pingyin": "bì shí jī xū",
        "explanation": "避实击虚指避开敌人的主力，找敌人的弱点进攻。又指谈问题回避要害。",
        "source": "《孙子·虚实》",
        "memo": "《孙子·虚实》：“兵之形，避实而击虚。”",
        "story": "公元前623年，晋楚在城濮交战，晋文公采用避实就虚的作战方法，避免与楚军的中军主力决战，先令其下军向楚右军进攻，因为楚右军是由陈、蔡两国军队组成的弱势部队，一举取胜。晋军主将狐毛又用计诱歼了楚左军，最终取得重大胜利。",
        "character": [
            "晋文公"
        ]
    },
    {
        "idiom": "比肩而立",
        "pingyin": "bǐ jiān ér lì",
        "explanation": "比喻彼此距离极近。",
        "source": "《战国策·齐策三》",
        "memo": "《战国策·齐策三》：“寡人闻之，千里而一士，是比肩而立；百世而一圣，若随踵而至。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "杯盘狼藉",
        "pingyin": "bēi pán láng jiè",
        "explanation": "杯盘等放得乱七八糟。形容宴饮已毕或将毕时的情景。",
        "source": "《史记》",
        "memo": "史记》卷一百二十六〈滑稽列传〉：日暮酒阑，合尊促坐，男女同席，履舄交错，杯盘狼藉，堂上烛灭，主人留髡而送客，罗襦襟解，微闻芗泽，当此之时，髡心最欢，能饮一石。",
        "story": "",
        "character": []
    },
    {
        "idiom": "驳马虎疑",
        "pingyin": "bó mǎ hu yí",
        "explanation": "不要被表面现象所迷惑，而要认识和把握事物的本质。",
        "source": "《管子 小问篇》",
        "memo": "《管子 小问篇》：“此驳象也，驳食虎豹，故虎疑焉。”",
        "story": "桓公骑马，虎看见而躲藏起来，桓公问管仲说：“今天我骑马外出，虎看见都不敢来，这是什么原因呢？”管仲回答说：“我猜您是骑着杂毛色的马在路上盘旋，并且迎着太阳奔跑的吧？”桓公说：“是这样的。”管仲回答说：“这种马形状很像驳，驳是能吃老虎豹子的，所以虎就疑心了。”",
        "character": [
            "齐桓公",
            "管仲"
        ]
    },
    {
        "idiom": "长夜漫漫",
        "pingyin": "cháng yè màn màn",
        "explanation": "无边际的样子。漫长的黑夜无边无际。多用来比喻社会的黑暗。",
        "source": "《淮南子·宁戚〈饭牛歌〉》",
        "memo": "《淮南子·宁戚〈饭牛歌〉》：“生不逢尧与舜禅，短布单衣才至骭，从昏饭牛薄夜半，长夜漫漫何时旦。”",
        "story": "春秋时期，齐桓公派管仲去接陈国和曹国的军队联合讨伐宋国。管仲路上遇到了放牛娃宁戚，宁戚骑牛唱道：“生不逢尧与舜禅，短布单衣才至骭，从昏饭牛薄夜半，长夜漫漫何时旦。”齐桓公见他有学问就任他为大夫。",
        "character": [
            "齐桓公",
            "管仲",
            "宁戚"
        ]
    },
    {
        "idiom": "长缨在手",
        "pingyin": "cháng yīng zài shǒu",
        "explanation": "比喻所武装力量掌握在手中。",
        "source": "《汉书·终军传》",
        "memo": "东汉·班固《汉书·终军传》：“军自请：愿受长缨，必羁南越王而致阙下。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "出奇制胜",
        "pingyin": "chū qí zhì shèng",
        "explanation": "在关键时候，出奇兵取得速胜。",
        "source": "《孙子兵法》",
        "memo": "《孙子兵法》：“凡战者，以正合，以奇（ji）胜。故善出奇者，无穷如天地，不竭如江河。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "出其不意",
        "pingyin": "chū qí bú yì",
        "explanation": "趁对方没有意料到就采取行动。后也泛指出乎别人的意料。",
        "source": "《孙子·计篇》",
        "memo": "《孙子·计篇》：“攻其无备，出其不意。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "丑若无盐",
        "pingyin": "chǒu ruò wú yán",
        "explanation": "比喻某人长得非常丑。",
        "source": "《抱朴子.论仙》",
        "memo": "晋葛洪《抱朴子.论仙》:”不可以无盐宿瘤之丑,而谓在昔无南威西施之美。",
        "story": "相传为齐国无盐邑 (今山东东平)人，世称无盐女。其状貌丑陋无比，年四十而未嫁。她关心政事，有隐身之术。曾自诣齐宣王，当面指责其奢淫腐败，宣王为之感动，乃“罢女乐，退谄谀”，并卜择吉日，立无盐为后.",
        "character": [
            "无盐女",
            "齐宣王"
        ]
    },
    {
        "idiom": "大公无私",
        "pingyin": "dà gōng wú sī",
        "explanation": "指办事公正，没有私心。现多指从集体利益出发，毫无个人打算。",
        "source": "《忠经·天地神明》",
        "memo": "汉·马融《忠经·天地神明》：“忠者中也，至公无私。”",
        "story": "”春秋时，晋平公有一次问祁黄羊说：“南阳县缺个县长， 你认为， 该派谁去当比较合适呢?”祁黄羊毫不迟疑地回答说：“叫解狐去， 最合适了。 他一定能够胜任的!”平公惊奇地又问他：“解狐不是你的仇人吗? 你为什么还要推荐他呢?”祁黄羊说：你只问我什么人能够胜任， 谁最合适; 你并没有问我解狐是不是我的仇人呀!|于是，平公就派解狐到南阳县去上任了。 解狐到任后。 替那里的人办了不少好事， 大家都称颂他。过了一些日子， 平公又问祁黄羊说：“ 现在朝廷里缺少一个法官。 你认为， 谁能胜任这个职位呢?”祁黄羊说：”祁午能够胜任的。“平以又奇怪起来了， 问道：” 祁午不是你的儿子吗? 你怎么推荐你的儿子， 不怕别人讲闲话吗?“祁黄羊说：”你只问我谁可以胜任， 所以我推荐了他; 你并没有问我祁午是不是我的儿子呀!“平公就派了祁午去做法官。 祁午当上了法官， 替人们办了许多好事， 很受人们的欢迎与爱戴。 孔子听到这两件事， 十分称赞祁黄羊。孔子说：“ 祁黄羊说得太好了! 他推荐人， 完全是拿才能做标准， 不因为他是自己的仇人，存心偏见， 便不推荐他; 也不因为他是自己的儿子， 怕人议论， 便不推荐。 像祁黄羊这样的人， 才够得上说：‘大公无私’啦!””",
        "character": [
            "晋平公",
            "祁黄羊"
        ]
    },
    {
        "idiom": "大庭广众",
        "pingyin": "dà tíng guǎng zhòng",
        "explanation": "为数很多的人群。指聚集很多人的公开场合。",
        "source": "《孔丛子·公孙龙》",
        "memo": "《孔丛子·公孙龙》：“使此人于广庭大众之中，见侮而不敢斗，王将以为臣乎？”",
        "story": "战国时期，齐国国君齐暋王自称爱结交士人，他对尹文说为什么齐国没有士人。尹文说士人是指讲忠、孝、信、义的人。齐暋王同意他的看法。[1]  尹文问这种士人在大庭广众之下受到欺侮而不敢争斗算好的士人吗？齐暋王表示不愿任用这类人。",
        "character": [
            "齐暋王",
            "尹文"
        ]
    },
    {
        "idiom": "箪食壶浆",
        "pingyin": "dān shí hú jiāng",
        "explanation": "形容军队受到群众热烈拥护和欢迎的情况。",
        "source": "《孟子·梁惠王下》",
        "memo": "《孟子·梁惠王下》：“以万乘之国伐万乘之国，箪食壶浆以迎王师，岂有他哉！避水火也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "呆若木鸡",
        "pingyin": "dāi ruò mù jī",
        "explanation": "形容人因恐惧或惊吓而愣住的样子，就像木头做的鸡，一动不动。",
        "source": "《庄子·达生》",
        "memo": "庄周《庄子·达生》与列御寇《列子·黄帝篇》：“鸡虽有鸣者，已无变矣，望之似木鸡矣；其德全矣，异鸡无敢应者，反走矣。”",
        "story": "”战国时，斗鸡是贵族们寻欢作乐的一项活动，齐王便是当时的一位斗鸡迷。为了能在斗鸡场上取胜，齐王特地请专家纪子帮他训鸡。齐王求胜心切，没过几天，便派人来催问，纪子说：“鸡没训好，它一见对手，就跃跃欲试，沉不住气。”过了几天，齐王又派人来问，纪子说：“还不到火候，看样子鸡虽不乱动了，但还不够沉稳。”又过了几天，纪子终于对来人说：“请你告诉齐王，我花工夫把鸡训好了。”待到斗鸡时，对手的鸡又叫又跳，而纪子训好的鸡却像只木鸡，一点反应也没有，别的鸡看到它那副呆样竟然都被吓跑了。因此，齐王用这只鸡和别人斗，自然场场获胜。他那高兴的样子就甭提了。”",
        "character": [
            "纪子",
            "齐王"
        ]
    },
    {
        "idiom": "得心应手",
        "pingyin": "dé xīn yìng shǒu",
        "explanation": "谓心手相应，运用自如。多形容技艺纯熟。",
        "source": "《庄子·天道》",
        "memo": "《庄子·天道》：“不徐不疾，得之于手而应于心。”",
        "story": "”古时，匏巴弹琴，鸟儿会随着乐声而舞，鱼儿跃出水面倾听。郑国的师文听说后，就去拜师襄为师学琴。师文学了三年，柱指钧弦，却弹不出一首完整的曲子。师襄无奈地说：“你可以回家去了。”师文扔掉琴，叹息道：“我不是不会指法，也不是不能完整地弹一首曲子。而是我心不在琴弦上，心里也没有音乐。由于内心找不到音乐的感受，所以手指就不能和琴弦相配合了。你再给我一些时间，让我找一找音乐的感受。”过了不久，师文回来见师襄。师襄说：“你的琴炼得如何？”师文告诉他：“我已找到音乐的感受，请听我弹一曲。”当春天时叩击商弦弹南吕调，凉风突起，草木都结出了果实。秋天时叩击角弦弹夹钟调，和风徐徐地吹起，花草树木都开花发芽了。夏天时叩击羽弦弹黄钟调，霜雪交下，河塘里都结冰了。冬天时叩击徵弦弹蕤宾调，阳光变得炽热，厚厚的冰块一下就融化了。一曲将终时，则以宫弦为主与其它四弦一并奏起，这时吹来了和丽的风，天空中漂着吉祥的云朵，降下了甘露，地下涌出了清清的泉水。师襄抚心高蹈说：“你的弹奏真是妙啊！即使师旷之清角，邹衍之吹律，也比不上你。我得挟琴执管向你学琴了。””",
        "character": [
            "师襄",
            "师文"
        ]
    },
    {
        "idiom": "得意洋洋",
        "pingyin": "dé yì yáng yáng",
        "explanation": "形容十分得意的样子或称心如意、沾沾自喜的样子。",
        "source": "《史记·管晏列传》",
        "memo": "西汉·司马迁《史记·管晏列传》：“意气扬扬，甚自得也。",
        "story": "”春秋时期，齐国名相晏婴政绩卓著。专门为他驾车的车夫，也倍觉荣耀。晏婴每次出行，马壮车美，那车夫高坐在华丽的车蓬前赶马驾车，总是露出一副惹路人羡慕的神态。车夫的表现引起了他妻子的不安。这天，听闻晏婴车马经过家门，她从门缝里看了个明白。晚上，丈夫一回到家，妻子便提出要离婚分手。犹如晴天霹雳，车夫登时愕然：“好端端地为何要散？”只听妻子说道：“晏子个头不高，但肩负国相重任，名扬天下。他坐在车上，神情稳重深沉，没有一点自满的样子。而你呢，虽然身材高大，但不过是驾车人而已，却那么意气洋洋，不可一世。你如此妄自尊大，我怎能继续跟你过下去啊！”一番话使车夫羞愧不已。从此，车夫行为检点，对人态度谦虚。车夫转变突然，晏婴纳罕，细问之下，方知原委，赞赏车夫勇于改过。后来，晏婴还举荐车夫担任大夫之职。”",
        "character": [
            "晏婴"
        ]
    },
    {
        "idiom": "东食西宿",
        "pingyin": "dōng shí xī sù",
        "explanation": "贪婪的人各方面的好处都要。",
        "source": "《风俗通》",
        "memo": "《风俗通》：“欲东家食，而西家宿。”此为两袒者也。",
        "story": "齐国有户人家有个女儿，有两家人来求婚。东家的男子长得丑陋但是家境富裕，西家的男子容貌美但是家里很贫穷。父母犹豫不能决定，就询问他们的女儿，要她自己决定想要嫁的人家（说）:“(你)要是难于亲口指明，不用指明表白，就将一只胳膊袒露出来，让我们知道你的意思。” 女儿就袒露出两只胳膊。父母亲感到奇怪就问她原因。女儿说：“（我）想在东家吃饭，在西家住宿。”",
        "character": []
    },
    {
        "idiom": "斗鸡走犬",
        "pingyin": "dòu jī zǒu quǎn",
        "explanation": "指旧时剥削阶级子弟游手好闲的无聊游戏。",
        "source": "《战国策·齐策一》",
        "memo": "《战国策·齐策一》：“临淄甚富而实，其民无不吹竽鼓瑟、击筑弹琴、斗鸡走犬、六博蹋踘者。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "断章取义",
        "pingyin": "duàn zhāng qǔ yì",
        "explanation": "指不顾全篇文章或谈话的内容，孤立地取其中的一段或一句的意思。",
        "source": "《左传·襄公二十八年》",
        "memo": "《左传·襄公二十八年》：“赋诗断章，余取所求焉”。",
        "story": "”卢蒲癸的妻子庆姜见丈夫行动诡秘，问他在干些什么。卢蒲癸便把准备杀灭庆氏，为庄公报仇的事说了。庆姜很识大义，表示愿意帮助丈夫完成这一义举。庆姜说到做到。卢蒲癸选在庆封出猎的那一天行动，庆姜说服父亲随同齐景公一起到太庙行祭礼，以便卢蒲癸等下手。举行祭礼时，卢蒲癸和王何突然执戈猛刺庆舍，庆舍垂死挣扎，用酒壶砸死了王何，卢蒲癸又领兵杀尽庆氏余党。庆封在出猎途中得到这个消息，带着出猎的士兵回来攻城，但城中防守严密，无法攻克，他只得逃到鲁国去了。事后，有人问卢蒲癸说：“庆氏和卢氏都是姜氏的后裔，你怎么会娶同宗的庆姜为妻呢？”卢蒲癸回答说：“庆舍不避同宗，要把女儿嫁给我，我为什么要避开呢?就像有人对《诗经》断章取义，来表达自己的意思，我也只取我所想要的，管什么同宗不同宗呢？””",
        "character": [
            "卢蒲癸",
            "庆姜"
        ]
    },
    {
        "idiom": "返璞归真",
        "pingyin": "fǎn pú guī zhēn",
        "explanation": "指去掉外在的装饰，恢复原来的质朴状态。",
        "source": "《战国策齐策四》",
        "memo": "《战国策齐策四》君子曰：“触知足矣，归真返璞，则终身不辱。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "飞熊入梦",
        "pingyin": "fēi xióng rù mèng",
        "explanation": "原指周文王梦飞熊而得太公望。后比喻圣主得贤臣的征兆。",
        "source": "《史记·齐太公世家》",
        "memo": "西汉·司马迁《史记·齐太公世家》：“西伯将出猎，卜之，曰‘所获非龙非彲，非虎非罴；所获霸王之辅’。”",
        "story": "商朝末年，周文王姬昌急需一个能文能武的人来辅佐，他苦苦寻找。一天他做了一个梦，梦见一只生有双翅的熊飞进自己的怀中。第二天他叫人占卜预示即可找到这个人，于是带领人马到渭水边找到直钩钓鱼的姜尚，他号飞熊，从此文王如虎添翼",
        "character": [
            "周文王",
            "姜尚"
        ]
    },
    {
        "idiom": "焚券市义",
        "pingyin": "fén quàn shì yì",
        "explanation": "用烧掉债券来收买人心",
        "source": "《战国策·齐策》",
        "memo": "",
        "story": "”战国时期，齐国孟尝君有一门客冯谖。有一次，孟尝君派冯谖到薛国收债。冯谖向孟尝君辞行，并请示：“收完债，您需要买些什么东西吗？”孟尝君顺口答道：“先生看我家里缺什么，就买些什么吧！”冯谖驱车来到薛国，派人把所有负债之人都召集到一起，核对完账目后，他便假传孟尝君的命令，免去所有的欠款，并当面烧掉了债券，百姓感激不已，皆呼万岁。随即返回，一大早便去求见孟尝君，孟尝君没料到他回来得这么快，半信半疑地问：“债都收完了吗?”冯谖答：“收完了。”“那你给我买了些什么回来呢?”孟尝君又问。冯谖不慌不忙地答：“您让我看家里缺少什么就买什么，我考虑到您有用不完的珍宝，数不清的牛马牲畜，美女也站满庭院，缺少的只有‘义’，因此我为您买‘义’回来了。”孟尝君不知所云，忙问“买义”是什么意思。冯谖就把事情经过说了。孟尝君听后心里很不高兴，只得悻悻地说“算了吧!”一年后，孟尝君由于失宠于齐闵王而被赶出国都，只好回到薛国。当孟尝君的车子距薛国还有上百里远时，薛邑百姓便已扶老携幼，夹道相迎。孟尝君好生感慨，回头对冯谖说：“先生您为我所买的‘义’，今天终于看见了!””",
        "character": [
            "孟尝君",
            "冯谖"
        ]
    },
    {
        "idiom": "覆水难收",
        "pingyin": "fù shuǐ nán shōu",
        "explanation": "倒在地上的水难以收回。比喻事情已成定局，难以挽回。",
        "source": "《后汉书·何进传》",
        "memo": "《后汉书·何进传》：“国家之事易可容易？覆水不收，宜深思之。”",
        "story": "”商朝末年，有个足智多谋的人物，姓姜名尚，字子牙，人称姜太公。因先祖封于吕，又名吕尚。他辅佐周文王、周武王攻灭商朝，建立周朝，立了大功。后来封在齐，是春秋时齐国的始祖。姜太公曾在商朝当过官，因为不满纣王的残暴统治，弃官而走，隐居在陕西渭水河边一个比较偏僻的地方。为了取得周族的领袖姬昌（即周文王）的重用，他经常在小河边用不挂鱼饵的直钩，装模作样地钓鱼。姜太公整天钓鱼，家里的生计发生了问题，他的妻子马氏嫌他穷，没有出息，不愿再和他共同生活，要离开他。姜太公一再劝说她别这样做，并说有朝一日他定会得到富贵。但马氏认为他在说空话骗她，无论如何不相信。姜太公无可奈何，只好让她离去。后来，姜太公终于取得周文王的信任和重用，又帮助周武王联合各诸侯攻灭商朝，建立西周王朝。马氏见他又富贵又有地位，懊悔当初离开了他。便找到姜太公请求与他恢复夫妻关系。姜太公已看透了马氏的为人，不想和她恢复夫妻关系，便把一壶水倒在地上，叫马氏把水收起来。马氏赶紧趴在地上去取水，但只能收到一些泥浆。于是姜太公冷冷地对她说：“你已离我而去，就不能再合在一块儿。这好比倒在地上的水，难以再收回来了！””",
        "character": [
            "姜尚",
            "周文王"
        ]
    },
    {
        "idiom": "负隅顽抗",
        "pingyin": "fù yú wán kàng",
        "explanation": "比喻依仗某种条件顽固抵抗或垂死挣扎",
        "source": "《孟子·尽心下》",
        "memo": "先秦·孟轲《孟子·尽心下》：“有众逐虎。虎负嵎，莫之敢撄。”",
        "story": "战国时，有一年齐国发生饥荒，许多人饿死。孟子的弟子陈臻（zhēn）听到这个消息，急忙来找老师，心情沉重地说：“老师，您听说了吗？齐国闹饥荒，人都快饿死了。人都以为老师您会再次劝说齐王，请他打开棠地的谷仓救济百姓。我看不能再这样做了吧。”孟子回答说：“再这样做，我就成为冯妇了。”接着，孟子向陈臻讲述了有关冯妇的故事。 冯妇是晋国的猎手，善于和老虎搏斗。后来他成为善人，不再打虎了，他的名字也几乎被人们忘掉。 有一年，某座山里出现了一只猛虎，常常伤害行人。几个年轻猎人联合起来去打虎，他们把老虎追至山的深处，老虎背靠着一个山势弯曲险要的地方，面向众人。它瞪圆了眼睛吼叫，没有人敢上前去捕捉。就在这时，冯妇坐车路过这儿。猎手们见了他，都快步上前迎接，请他帮助打虎。冯妇下了车，挽起袖子与老虎搏斗起来，经过一场拼搏，终于打死了猛虎，为民除了害。年轻的猎手们高兴地谢他，可是一些读书人却讥笑他。",
        "character": [
            "陈臻",
            "孟子"
        ]
    },
    {
        "idiom": "扶老携幼",
        "pingyin": "fú lǎo xié yòu",
        "explanation": "形容所有人都出动了，也形容场面很大，人很多。",
        "source": "《战国策·齐策四》",
        "memo": "西汉·刘向《战国策·齐策四》：“夫至百里，民扶老携幼，迎君道中。”",
        "story": "”春秋时候，齐国有一位叫做孟尝君的人，他在家里养了三千个食客，孟尝君把这些人分成上、中、下三种等级。上等的客人每天都可以吃到大鱼大肉，出门的时候还有车子可以坐；中等的客人每天只有吃到鱼和菜；下等的客人每天吃到的就只有蔬菜而已。有一天，孟尝君的朋友介绍一个叫做冯谖(音：宣)的人到孟尝君家，孟尝君问他的朋友：“这个叫冯谖的人有什么专长呀？”朋友想了很久说：“好像没什么专长耶！”孟尝君听了之后，就不怎么理会冯谖，家里的佣人看到孟尝君不理冯谖，以为主人瞧不起冯谖，通通把冯谖当下等的客人招待。冯谖心里很不高兴，天天发牢骚：“既然大家都瞧不起我，我干脆离开算了！”孟尝君知道以后，就把冯谖由下等的客人升为上等的客人，还送给冯谖的母亲吃的和用的东西，冯谖心想：“孟尝君对我这么好，我一定要找机会报答他！”有一次，孟尝君派冯谖到薛地去讨债，冯谖就假装是孟尝君下的命令，叫所有欠孟尝君钱的人不用还钱，替孟尝君买了个“义”的好名声！而孟尝君却不知是为其好，并怪罪冯谖。后来孟尝君被齐王国君解除了相国的官位，回到薛地去住的时候，薛地的人民都热烈地欢迎孟尝君。人们带着老人，甚至连孩子也抱了出来，出城百里相迎。孟尝君笑道：“先生给我买的‘义’，我今天看到了！””",
        "character": [
            "孟尝君",
            "冯谖"
        ]
    },
    {
        "idiom": "风驰电掣",
        "pingyin": "fēng chí diàn chè",
        "explanation": "形容非常迅速，像风吹电闪一样。",
        "source": "《六韬·龙韬·王翼》",
        "memo": "《六韬·龙韬·王翼》：“奋威四人，主择材力，论兵革，风驰电掣，不知所由。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "风雨同舟",
        "pingyin": "fēng yǔ tóng zhōu",
        "explanation": "指在狂风暴雨中同乘一条船，一起与风雨搏斗。比喻共同经历患难。",
        "source": "《孙子·九地》",
        "memo": "《孙子·九地》：“夫吴人与越人相恶也，当其同舟共济，遇风，其相救也如左右手。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "管鲍之交",
        "pingyin": "guǎn bào zhī jiāo",
        "explanation": "形容自己与好朋友之间彼此信任的关系。",
        "source": "《列子·力命》",
        "memo": "《列子·力命》：“生我者父母，知我者鲍叔也。”",
        "story": "“管鲍”，是指公元前7世纪中国春秋时期的政治家管仲和鲍叔牙，他们俩是好朋友。管仲比较穷，鲍叔牙比较富有，但是他们之间彼此了解、相互信任。管仲和鲍叔牙之间深厚的友情，已成为中国代代流传的佳话。在中国，人们常常用“管鲍之交”，来形容自己与好朋友之间亲密无间、彼此信任的关系。",
        "character": [
            "管仲",
            "鲍叔牙"
        ]
    },
    {
        "idiom": "高枕无忧",
        "pingyin": "gāo zhěn wú yōu",
        "explanation": "比喻平安无事，不用担忧。也比喻放松警惕。",
        "source": "《战国策·魏策一》",
        "memo": "《战国策·魏策一》：“事秦，则楚韩必不敢动，无楚韩之患，则大王高枕而卧，国必无忧矣。”",
        "story": "冯谖就跑去找梁国的国君梁惠王，告诉梁惠王孟尝君非常能干，梁惠王听了之后立刻派人带着一千斤黄金、一百辆马车去请孟尝君到梁国做相国。 这个消息传到了齐国，齐国的国君马上慌张起来，赶快用隆重的礼节请孟尝君回去齐国做相国。同时，冯谖又叫孟尝君在薛地建立宗庙，用来保证薛地的安全。等到薛地的宗庙建好以后，冯谖就对孟尝君说：“现在三个洞都已经挖好了，从今天起，您就可以把枕头垫高，安心地睡觉了（三窟已就，君姑高枕为乐矣）！”",
        "character": [
            "冯谖",
            "孟尝君"
        ]
    },
    {
        "idiom": "高下其手",
        "pingyin": "gāo xià qí shǒu",
        "explanation": "比喻玩弄手法，串通做弊。",
        "source": "《渑水燕谈录·官制》",
        "memo": "宋·王辟之《渑水燕谈录·官制》：“五代以来，诸州马步军虞侯以衙校为之，太祖虑其任私，高下其手，乃置司寇参军，以进士、‘九经’及第人充之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "高门大屋",
        "pingyin": "gāo mén dà wū",
        "explanation": "指有钱有势的人家",
        "source": "《史记·孟子荀卿列传》",
        "memo": "西汉·司马迁《史记·孟子荀卿列传》：“皆命曰列大夫，为开第康庄之衢，高门大屋，尊宠之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "高冠博带",
        "pingyin": "gāo guàn bó dài",
        "explanation": "形容儒生的装束。也比喻穿着礼服。",
        "source": "《墨子·公孟》",
        "memo": "《墨子·公孟》：“昔者齐桓公，高冠博带，金剑木盾，以治其国。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "改过自新",
        "pingyin": "gǎi guò zì xīn",
        "explanation": "改正错误，重新做起。",
        "source": "《史记·孝文本纪》",
        "memo": "汉·司马迁《史记·孝文本纪》：“妾伤夫死者不可复生，刑者不可复属，虽复欲改过自新，其道无由也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "桂陵之战",
        "pingyin": "guì líng zhī zhàn",
        "explanation": "历史上一次著名截击战，发生在河南长垣西北",
        "source": "《史记·孙子吴起列传》",
        "memo": "",
        "story": "",
        "character": []
    },
    {
        "idiom": "规矩绳墨",
        "pingyin": "guī ju shéng mò",
        "explanation": "指应当遵守的标准、法则。",
        "source": "《管子·七臣七主》",
        "memo": "《管子·七臣七主》：“法律政令者，吏民规矩绳墨。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "国之四维",
        "pingyin": "guó zhī sì wéi",
        "explanation": "指治国的纲纪准则。",
        "source": "《管子·牧民》",
        "memo": "《管子·牧民》：“国有四维，一维绝则倾，二维绝则危，三维绝则覆，四维绝则灭。倾可正也，危可安也，覆可起也，灭不可复错也。何谓四维，一曰礼，二曰义，三曰廉，四曰耻。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "和而不同",
        "pingyin": "hé ér bù tóng",
        "explanation": "和睦地相处，但不随便附和。",
        "source": "《论语·子路》",
        "memo": "《论语·子路》：“君子和而不同，小人同而不和。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "涸泽之蛇",
        "pingyin": "hé zé zhī shé",
        "explanation": "要时时擦亮眼睛，善于透过现象看本质与事实。",
        "source": "《韩非子·说林上》",
        "memo": "战国·韩·韩非《韩非子·说林上》：“子独不闻涸泽之蛇首？泽涸，蛇将徙。”",
        "story": "田成子离开齐国,逃往燕国,鸱夷子皮背着出关的符牒跟随着.到了望邑,子皮说:”您 难道没听说过干枯湖沼的蛇吗 湖沼干枯,蛇准备迁移.有条小蛇对大蛇说:'您走在前面,我跟在后面,人们会认为这只不过是过路的蛇,必然有人杀死您.不如相互衔着,您背着我走,人们会把我看作神君.'于是相互衔嘴,背着穿过大路.人们都躲开它们,说它们是神君.现在您美而我丑.把您作为我的上客,人们会把我看成千乘小国的君主;把您作为我的使者,人们会把我看成万乘大国的卿相.您不如做我的近侍,人们就会把我看成是万乘大国的君主.”田成子因此背着符牒跟随在后.到了客店,客店主人非常恭敬地招待了他们,并献上了酒肉.",
        "character": [
            "田成子",
            "鸱夷子皮"
        ]
    },
    {
        "idiom": "挥汗成雨",
        "pingyin": "huī hàn chéng yǔ",
        "explanation": "用手抹汗，汗洒下去就跟下雨一样，也形容出汗多。",
        "source": "《战国策·齐策一》",
        "memo": "《战国策·齐策一》：“连衽成帷，举袂成幕，挥汗成雨。” 《史记·苏秦列传》：“车毂击，人肩摩，连衽成帷，举袂成幕，挥汗成雨。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "比肩继踵",
        "pingyin": "bǐ jiān jì zhǒng",
        "explanation": "形容人很多，很拥挤。",
        "source": "《晏子春秋·杂下》",
        "memo": "《晏子春秋·杂下》：“临淄三百闾，张袂成阴，挥汗成雨，摩肩接踵而在，何为无人。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "摩肩接踵",
        "pingyin": "mó jiān jiē zhǒng",
        "explanation": "形容人多拥挤。",
        "source": "《晏子春秋·内篇·杂下》",
        "memo": "《晏子春秋·内篇·杂下》“临淄三百闾，张袂成阴，挥汗成雨，比肩接踵而在”",
        "story": "",
        "character": []
    },
    {
        "idiom": "讳疾忌医",
        "pingyin": "huì jí jì yī",
        "explanation": "比喻怕人批评而掩饰自己的缺点和错误。",
        "source": "《周子通书·过》",
        "memo": "宋·周敦颐《周子通书·过》：“今人有过，不喜人规，如讳疾而忌医，宁灭其身而无悟也。”",
        "story": "”名医扁鹊，有一次去见蔡桓公。他在旁边立了一会儿对桓公说：“你有病了，现在病还在皮肤的纹理之间，若不赶快医治，病情将会加重!”桓公听了笑着说：“我没有病。”待扁鹊走了以后，桓公对人说：“这些医生就喜欢医治没有病的人把这个当做自己的功劳”　　十天以后，扁鹊又去见桓公，说他的病已经发展到肌肉里，如果不治，还会加重。桓公不理睬他。扁鹊走了以后，桓公很不高兴。　　再过了十天，扁鹊又去见桓公，说他的病已经转到肠胃里去了，再不从速医治，就会更加严重了。桓公仍旧不理睬他。　　又过了十天，扁鹊去见桓公时，对他望了一望，回身就走。桓公觉得很奇怪，于是派使者去问扁鹊。扁鹊对使者说：“病在皮肤的纹理间是烫熨的力量所能达到的；病在肌肤是针石可以治疗的；在肠胃是火剂可以治愈的；病若是到了骨髓里，那是司命所掌管的事了，我也没有办法了。而今在骨髓，我不再请求了。　　五天以后，桓公浑身疼痛，赶忙派人去请扁鹊，扁鹊却早已经逃到秦国了。桓公不久就死掉了。良医治病，病在表皮时就及时医治。这是为了在刚显露苗头时及时处理。事情的祸福也有开端，所以圣人总是尽可能早地予以处理。”",
        "character": [
            "扁鹊",
            "蔡桓公"
        ]
    },
    {
        "idiom": "华而不实",
        "pingyin": "huá ér bù shí",
        "explanation": "比喻外表好看，内容空虚。也指表面上很有学问，实际腹中空空的人。",
        "source": "《左传·文公五年》",
        "memo": "左丘明《左传·文公五年》：“且华而不实，怨之所聚也。”",
        "story": "”春秋时，晋国有个大臣叫阳处父，喜欢高谈论阔，有一天，宁赢看见阳处父相貌堂堂，举止不凡，十分钦佩，悄悄对妻子说：“我早想投奔一位品德高尚的人，可是多少年来，随时留心，都没找到一个合意的。今天我看阳处父这个人不错，我决定跟他去了。”宁赢得到阳处父的同意，离别妻子，跟着他走了。一路上，阳处父同店主东拉西扯，不知谈些什么，宁赢一边走，一边听。过了几天，宁赢改变了主意，和阳处父分手了。妻子见丈夫突然折回，心中不明，问道：“你好不容易遇到这么个人，怎么不服他去呢？你不是决心很大吗？家里的事你尽管放心好了。”“我看到他长得一表人才，以为他可以信赖，谁知听了他的言论，却感到非常讨厌。我怕跟他一去，没有得到教育，反倒遭受祸害，所以打消了原来的主意。”宁赢说。果然，一年后，阳处父被杀了。”",
        "character": [
            "阳处父",
            "宁赢"
        ]
    },
    {
        "idiom": "画蛇添足",
        "pingyin": "huà shé tiān zú",
        "explanation": "后比喻做了多余的事，非但无益，反而不合适。也比喻虚构事实，无中生有。",
        "source": "《战国策·齐策二》",
        "memo": "",
        "story": "”古时候，楚国有一家人，祭完祖宗之后，准备将祭祀用的一壶酒，赏给帮忙办事的人员喝。参加的人很多，这壶酒如果大家都喝是不够的，若是让一个人喝，那能喝得有余。这一壶酒到底怎么分呢？大家都安静下来，这时有人建议：每个人在地上画一条蛇，谁画得快又画得好，就把这壶酒归他喝。大家都认为这个方法好，都同意这样做。于是，在地上画起蛇来。有个人画得很快，一转眼最先画好了，他就端起酒壶要喝酒。但是他回 头看看别人，还都没有画好呢。心里想：他们画得真慢。又想显示自己的本领， 他洋洋得意地说： “你们画得好慢啊！我再给蛇画几只脚也不算晚呢！”于是，他便左手提着酒壶，右手拿了一根树枝，给蛇画起脚来。正在他一边画着脚，一边说话的时候，另外一个人已经画好了。那个人 马上把酒壶从他手里夺过去，说：””你见过蛇吗？蛇是没有脚的，你为什么要给它添上脚呢？所以第一个画好蛇的人不是你，而是我了！””那个人说罢就仰起头来，咕咚咕咚把酒喝下去了。”",
        "character": []
    },
    {
        "idiom": "讳莫如深",
        "pingyin": "huì mò rú shēn",
        "explanation": "原指事件重大，讳而不言。后指把事情真相隐瞒得很深。",
        "source": "《谷梁传·庄公三十二年》",
        "memo": "《谷梁传·庄公三十二年》：“何也？讳莫如深，深则隐。苟有所见，莫如深也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "鸡鸣狗盗",
        "pingyin": "jī míng gǒu dào",
        "explanation": "指微不足道的本领。也指偷偷摸摸的行为。",
        "source": "《史记·孟尝君列传》",
        "memo": "",
        "story": "齐孟尝君出使秦被昭王扣留，孟一食客装狗钻入秦营偷出狐白裘献给昭王妾以说情放孟。孟逃至函谷关时昭王又令追捕。另一食客装鸡叫引众鸡齐鸣骗开城门，孟得以逃回齐。",
        "character": [
            "孟尝君",
            "秦昭王"
        ]
    },
    {
        "idiom": "及瓜而代",
        "pingyin": "jí guā ér dài",
        "explanation": "有一定的轮替期限，期限一到，自然有人交替。",
        "source": "《左传·庄公八年》",
        "memo": "《左传·庄公八年》：“齐侯使连称，管至父戍葵丘。瓜时而往，曰：‘及瓜而代。’”",
        "story": "”齐襄公的表弟公孙无知的父亲去世得早，襄公的父亲釐公很喜欢公孙无知，以太子的待遇对待他，齐襄公很妒忌。齐襄公一当了国君，马上就除去了公孙无知的待遇。十二后，齐襄公派连称□管至父去戍守葵丘（今山东临淄县西），瓜期时（七月）派他们去，答应等到第二年瓜期时就派人代替他们，让他们回来。可是一年过去了，瓜都烂在地里了，齐襄公也不派人去代替，有人提醒齐襄公，齐襄公也不管。这两个人很生气，于是联合公孙无知，带领部队回到都城，冲进王宫，杀了齐襄公，公孙无知自称齐王。”",
        "character": [
            "公孙无知",
            "齐襄公"
        ]
    },
    {
        "idiom": "嗟来之食",
        "pingyin": "jiē lái zhī shí",
        "explanation": "指带有侮辱性的施舍",
        "source": "《礼记·檀弓下》",
        "memo": "《礼记·檀弓下》：“予唯不食嗟来之食，以至于斯也！”",
        "story": "”春秋战国时期，有一年，齐国发生了一次严重的饥荒，一大批穷人由于缺粮少食，而被活活地饿死。有一位名叫黔敖的贵族奴隶主在大路旁摆上一些食物，等着饿肚子的穷人经过，施舍给他们。一天，一个饿得不成样子的人用袖子遮着脸，拖着一双破鞋子，摇摇晃晃地走过，黔敖看到后，便左手拿起食物，右手端起汤，傲慢地吆喝道：“喂!来吃吧!”那个饿汉抬起头轻蔑地瞪了他一眼，说道：“我就是因为不吃这种‘嗟来之食’才饿成这个样子的。” 黔敖也觉得自己做得有点过分，便向饿汉赔礼道歉，但那饿汉最终还是不肯吃而饿死于路旁。”",
        "character": [
            "黔敖"
        ]
    },
    {
        "idiom": "接踵而至",
        "pingyin": "jiē zhǒng ér zhì",
        "explanation": "指人们前脚跟着后脚，接连不断地来。形容来者很多，络绎不绝。",
        "source": "《战国策·齐策三》",
        "memo": "《战国策·齐策三》：“子来，寡人闻之，千里而一士，是比肩而立，百世而一圣，若随踵而至也，今子一朝而见七士，则士不亦众乎！”",
        "story": "",
        "character": []
    },
    {
        "idiom": "见异思迁",
        "pingyin": "jiàn yì sī qiān",
        "explanation": "看见另一个事物就想改变原来的主意。指意志不坚定，喜爱不专一。",
        "source": "《管子·小匡》",
        "memo": "《管子·小匡》：“少而习焉，其心安焉，不见异物而迁焉。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "狡兔三窟",
        "pingyin": "jiǎo tù sān kū",
        "explanation": "比喻隐蔽的地方或方法多。",
        "source": "《战国策·齐策四》",
        "memo": "《战国策·齐策四》：“狡兔有三窟，仅得兔其死耳。”",
        "story": "”春秋时代，在齐国有位名叫孟尝君的人，他非常喜欢与文学家还有侠客风范的人交朋友，为了能与他们常讨论国家大事，总喜欢邀请这些人到家中长住。在这些人当中，有位叫冯谖的人，他常常一住就是住上很长一段时间，但是却什么事都不做，孟尝君虽然觉得很奇怪，但是好客的他还是热情招待冯谖。有一次，冯谖替孟尝君到薛地这地方讨债，但是他不但没跟当地百姓要债，反而还把债倦全烧了，薛地人民都以为这是孟尝君的恩德，而心里充满感激。直到后来，孟尝君被齐王解除相国的职位，前往薛地定居，受到薛地人热烈的欢迎，孟尝君才知道冯谖的才能。一直到这时候，不多话的冯谖才对孟尝君说：“通常聪明的兔子都有三个洞穴，才能在紧急的时候逃过猎人的追捕，而免除一死。但是你却只有一个藏身之处，所以你还不能把枕头垫得高高地睡觉，我愿意再为你安排另外两个可以安心的藏身之处。”于是冯谖去见梁惠王，他告诉梁惠王说，如果梁惠王能请到孟尝君帮他治理国家，那么梁国一定能够变得更强盛。于是梁惠王派人邀请孟尝君到梁国，准备让他担任治理国家的重要官职。可是，梁国的使者一连来了三次，冯谖都叫孟尝君不要答应。梁国派人请孟尝君去治理梁国的消息传到齐王那里，齐王一急，就赶紧派人请孟尝君回齐国当相国。冯谖要孟尝君向齐王提出希望能够拥有齐国祖传祭器的要求，并且将它们放在薛地,，同时兴建一座祠庙，以确保薛地的安全。祠庙建好后，冯谖对孟尝君说：“现在属于你的三个安身之地都建造好了，从此以后你就可以垫高枕头，安心地睡大觉了。””",
        "character": [
            "孟尝君",
            "冯谖"
        ]
    },
    {
        "idiom": "胶柱鼓瑟",
        "pingyin": "jiāo zhù gǔ sè",
        "explanation": "比喻固执拘泥，不知变通。",
        "source": "《史记·廉颇蔺相如列传》",
        "memo": "《史记·廉颇蔺相如列传》：“王以名使括，若胶柱而鼓瑟耳。括徒能读其父书传，不知合变也。”",
        "story": "齐人跟赵人学习瑟这种乐器。他不去刻苦钻研演奏瑟的技术，却依照赵人预先调弄好的音调，将瑟上调音的短柱用胶粘固起来，就高高兴兴地回到了家乡。齐人回家后，摆弄了多年，总是弹不出一支曲子。他还觉得奇怪呢!后来，有人从赵国来，了解到是怎么回事，觉得这个齐人的举动是多么愚蠢啊!",
        "character": []
    },
    {
        "idiom": "金壶丹书",
        "pingyin": "jīn hú dān shū",
        "explanation": "指锦囊妙计",
        "source": "《晏子春秋》",
        "memo": "《晏子春秋》：景公游于纪，得金壶，乃发视之，中有丹书。",
        "story": "齐景公在原纪国的土地上游历时，得到一个金壶，就打开一看，里面有红笔写成的文字：“吃鱼只吃一面，不翻过来吃，不要乘坐劣马。”景公说：“有道理！就像这样说的！吃鱼只吃一面，不翻过来吃，是因为不喜欢它的腥味；不乘坐劣马，是不喜欢它走不了远路。”晏子回答说：“不是这样啊！吃鱼只吃一面，不翻过来吃，是说不要用尽老百姓的力气。不要乘坐劣马，是说不要让没有才能的人在国君身边。”齐景公说：“纪国有这样深刻的言语，为什么会亡国呢？”晏子回答说：“有这样的言语也会亡国。我听说：‘君子有治理国家的好策略，一定会公行于天下。’纪国有这样的言语，却藏在金壶里，是多么庸俗浅陋，亡国还要等到什么时候呢？”",
        "character": [
            "齐景公",
            "晏子"
        ]
    },
    {
        "idiom": "尽善尽美",
        "pingyin": "jìn shàn jìn měi",
        "explanation": "内容和形式都完美无缺；没有缺点。形容事物完美到没有一点儿缺点。",
        "source": "《论语·八佾》",
        "memo": "《论语·八佾》：子谓《韶》：“尽美矣，又尽善也。”谓《武》：“尽美矣，未尽善也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "九合一匡",
        "pingyin": "jiǔ hé yì kuāng",
        "explanation": "原指春秋时代齐桓公多次会合各国诸侯，称霸华夏，使混乱不安的政局得以安定。",
        "source": "《论语·宪问》",
        "memo": "《论语·宪问》：“桓公九合诸侯。”又：“管仲相桓公，霸诸侯，一匡天下。”《史记·主父偃列传》：“昔得管仲相齐桓，霸诸侯，有九合一匡之功。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "居必择邻",
        "pingyin": "jū bì zé lín",
        "explanation": "住家必须选择好邻居。",
        "source": "《晏子春秋·杂上》",
        "memo": "《晏子春秋·杂上》：“君子居必择邻，游必就士。”",
        "story": "曾子离开齐国要走，晏子去送他，说：“君子赠给人车子，不如赠给人言语。我是赠给您言语呢，还是赠给您车子呢？”曾子说：“请赠给我言语。”晏子说：“车轮，是山上很直的树木制成的。技术好的工匠用火烤它，使它圆的程度符合圆规的要求，即使又把它晒干，也不再挺直了。所以君子对矫正弯曲很慎重。卞和得到的玉璞，看外表是井里的石块，技术好的玉工琢治它，就成为传国之宝了。所以君子对修养自己很慎重。",
        "character": [
            "曾子",
            "晏子"
        ]
    },
    {
        "idiom": "静若处子",
        "pingyin": "jìng ruò chǔ zǐ",
        "explanation": "指军队未行动时像未出嫁的姑娘那样持重；",
        "source": "《孙子·九地》",
        "memo": "《孙子·九地》：“是故始如处女，敌人开户；后如脱兔，敌不及拒。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "动若脱兔",
        "pingyin": "dòng ruò tuō tù",
        "explanation": "一行动就像飞跑的兔子那样敏捷。",
        "source": "《孙子·九地》",
        "memo": "《孙子·九地》：“是故始如处女，敌人开户；后如脱兔，敌不及拒。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "康庄大道",
        "pingyin": "kāng zhuāng dà dào",
        "explanation": "比喻光明美好的前途。",
        "source": "《史记·孟子荀卿列传》",
        "memo": "西汉·司马迁《史记·孟子荀卿列传》：“于是齐王嘉之，自如淳于髡以下，皆命曰列大夫，为开第康庄之衢，高门大屋，尊宠之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "开卷有益",
        "pingyin": "kāi juàn yǒu yì",
        "explanation": "谓打开书本阅读，就会有所得益。",
        "source": "《渑水燕谈录·文儒》",
        "memo": "宋·王辟之《渑水燕谈录·文儒》：“开卷有益，朕不以为劳也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "老马识途",
        "pingyin": "lǎo mǎ shí tú",
        "explanation": "意为老马认识曾经走过的道路。",
        "source": "《韩非子·说林上》",
        "memo": "《韩非子·说林上》：“管仲、隰朋从于桓公伐孤竹，春往冬返，迷惑失道。管仲曰：‘老马之智可用也。’乃放老马而随之。遂得道。”",
        "story": "管仲、隰(xi)朋从桓公伐孤竹，春往冬返，迷惑失道。管仲曰：“老马之智可用也。”乃放老马而随之，遂得道。释义“途”路。老马认识道路。比喻有经验的人熟悉情况，能在某个方面起指引的作用。故事公元前663年，齐桓公应燕国的要求，出兵攻打入侵燕国的山戎，相国管仲和大夫隰朋随同前往。齐军是春天出征的，到凯旋而归时已是冬天，草木变了样。大军在崇山峻岭的一个山谷里转来转去，最后迷了路，再也找不到归路；虽然派出多批探子去探路，但仍然弄不清楚该从哪里走出山谷。时间一长，军队的给养发生困难。情况非常危急，再不找到出路，大军就会困死在这里。管仲思索了好久，有了一个设想：既然狗离家很远也能寻回家去，那么军中的马尤其是老马，也会有认识路途的本领。于是他对齐桓公说：“大王，我认为老马有认路的本领，可以利用它在前面领路，带引大军出山谷。”齐桓公同意试试看。管仲立即挑出几匹老马，解开缰绳，让它们在大军的最前面自由行走。也真奇怪，这些老马都毫不犹豫地朝一个方向行进。大军就紧跟着它们东走西走、最后终于走出山谷，找到了回齐国的大路。",
        "character": [
            "管仲",
            "隰(xi)朋"
        ]
    },
    {
        "idiom": "两败俱伤",
        "pingyin": "liǎng bài jù shāng",
        "explanation": "斗争的双方都受到损伤",
        "source": "《史记·张仪列传》",
        "memo": "《史记·张仪列传》：“有顷，两虎果斗，大者伤，小者死，庄子从伤者而刺之，一举果有双虎之功。”",
        "story": "”战国的时候，有一个很聪明、讲话幽默的人，名叫淳于，他知道齐宣王正准备要去攻打魏国。便去晋见齐宣王，说：「大王，您听过韩子卢和东郭逡的故事吗？韩子卢是天底下最棒的猎犬，东郭逡是世界上最有名的狡兔。有一天，韩子卢在追赶东郭逡，一只在前面拼命的逃，一只在后面拼命的追，结果呢！它们两个都跑到精疲力竭，动弹不得，全倒在山脚下死了。这个时候，正好有个农夫经过，便毫不費力地把它们两个一齐带回家煮了吃掉。」齐宣王一听：「这跟我要去攻打魏国有什么关系呀？」淳于：「大王，现在齐国发兵去攻打魏国，一定不是能在短期內就可以打贏的。到头来，双方都弄成民穷财尽，两败俱伤，不但老百姓吃苦，国家的兵力也会大受损伤，万一秦国和楚国趁机来攻打我们，那不是平白送给他们机会一并吞掉齐国和魏国吗？」齐宣王听了淳于的话，觉得很有道理，就停止攻打魏国的计划。后来，大家在形容二個能力差不多的人互相争斗，不但谁也没贏还彼此都受了伤，就说是“两败俱伤”。”",
        "character": [
            "淳于",
            "齐宣王"
        ]
    },
    {
        "idiom": "韩卢逐逡",
        "pingyin": "hán lú zhú qūn",
        "explanation": "比喻争强斗胜，两败俱伤。",
        "source": "《战国策·齐策三》",
        "memo": "",
        "story": "传说古代天下跑得最快的狗是韩子卢，而跑得最快而且狡猾的兔子是东郭逡。一天一只韩子卢追逐东郭逡，围绕三座山跑了五圈，韩子卢还是没有追上东郭逡，结果两者都累死了。一个农夫刚好路过，轻易地捉住韩子卢和东郭逡。",
        "character": []
    },
    {
        "idiom": "连衽成帷",
        "pingyin": "lián rèn chéng wéi",
        "explanation": "衣襟相接而成帷幕。形容人多。",
        "source": "《史记·苏秦列传》",
        "memo": "《史记·苏秦列传》：“车毂击，人肩摩，连衽成帷，举袂成幕，挥汗成雨。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "临难铸兵",
        "pingyin": "lín nàn zhù bīng",
        "explanation": "临到危难时，方才铸造兵器。比喻平时不作准备，临时才想办法。",
        "source": "《梁书·韦叡传》",
        "memo": "《梁书·韦叡传》：“贼已至城下，方复求军，临难铸兵，岂及马腹。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "临噎掘井",
        "pingyin": "lín yē jué jǐng",
        "explanation": "临到食物堵塞住喉咙需要用水时才去掘井取水。比喻为时已晚。",
        "source": "《晏子春秋·内篇杂上》",
        "memo": "春秋·齐·晏婴《晏子春秋·内篇杂上》：“溺者不问坠，迷者不问路，溺而后问坠，迷而后问路，譬之犹临难而遽铸兵，噎而遽掘井，虽速，亦无及已。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "滥竽充数",
        "pingyin": "làn yú chōng shù",
        "explanation": "比喻没有本事的人冒充有本事；",
        "source": "《韩非子·内储说上》",
        "memo": "",
        "story": "”古时候，齐国的国君齐宣王爱好音乐，尤其喜欢听吹竽，手下有300个善于吹竽的乐师。齐宣王喜欢热闹，爱摆排场，总想在人前显示做国君的威严，所以每次听吹竽的时候，总是叫这300个人在一起合奏给他听。有个南郭先生听说了齐宣王的这个癖好，觉得有机可乘，是个赚钱的好机会，就跑到齐宣王那里去，吹嘘自己说：“大王啊，我是个有名的乐师，听过我吹竽的人没有不被感动的，就是鸟兽听了也会翩翩起舞，花草听了也会合着节拍颤动，我愿把我的绝技献给大王。”齐宣王听得高兴，不加考察，很爽快地收下了他，把他也编进那支300人的吹竽队中。这以后，南郭先生就随那300人一块儿合奏给齐宣王听，和大家一样享受着优厚的待遇，心里得意极了。其实南郭先生撒了个弥天大谎，他压根儿就不会吹竽。每逢演奏的时候，南郭先生就捧着竽混在队伍中，人家摇晃身体他也摇晃身体，人家摆头他也摆头，脸上装出一副动情忘我的样子，看上去和别人一样吹奏得挺投入，还真瞧不出什么破绽来。南郭先生就这样靠着蒙骗混过了一天又一天，不劳而获地白拿薪水。可是好景不长，过了几年，爱听竽合奏的齐宣王死了，他的儿子齐湣（min）王继承了王位。齐湣王也爱听吹竽，可是他和齐宣王不一样，认为300人一块儿吹实在太吵，不如独奏来得悠扬逍遥。于是齐湣王发布了一道命令，要这300个人好好练习，作好准备，他将让它300人轮流来一个个地吹竽给他欣赏。乐师们接到命令后都积极练习，都想一展身手，只有那个滥竽充数的南郭先生急得像热锅上的蚂蚁，惶惶不可终日。他想来想去，觉得这次再也混不过去了，只好连夜收拾行李逃走了。”",
        "character": [
            "齐宣王",
            "南郭",
            "齐湣王"
        ]
    },
    {
        "idiom": "乐极生悲",
        "pingyin": "lè jí shēng bēi",
        "explanation": "高兴到极点时，发生使人悲伤的事。",
        "source": "《淮南子·道应训》",
        "memo": "《淮南子·道应训》：“夫物盛而衰，乐极则悲。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "令行禁止",
        "pingyin": "lìng xíng jìn zhǐ",
        "explanation": "形容法令严正，纪律严明，执行认真。",
        "source": "《管子·立政》",
        "memo": "《管子·立政》：“令则行，禁则止，宪之所及，俗之所被。如百体之从心，政之所期也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "洛阳纸贵",
        "pingyin": "luò yáng zhǐ guì",
        "explanation": "比喻文章写得好，风行一时。",
        "source": "《晋书·文苑·左思传》",
        "memo": "《晋书·文苑·左思传》：“于是豪贵之家竞相传写，洛阳为之纸贵。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "门庭若市",
        "pingyin": "mén tíng ruò shì",
        "explanation": "形容交际来往的人很多。",
        "source": "《战国策·齐策一》",
        "memo": "西汉·刘向《战国策·齐策一》的：“令初下，群臣进谏，门庭若市。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "明察秋毫",
        "pingyin": "míng chá qiū háo",
        "explanation": "后多形容人能洞察一切，也指视力很好。",
        "source": "《孟子·梁惠王上》",
        "memo": "《孟子·梁惠王上》：“明足以察秋毫之末，而不见舆薪，则王许之乎？”",
        "story": "",
        "character": []
    },
    {
        "idiom": "灭此朝食",
        "pingyin": "miè cǐ zhāo shí",
        "explanation": "形容急于消灭敌人的心情和必胜的信心。",
        "source": "《左传·成公二年》",
        "memo": "《左传·成公二年》：齐侯曰：“余姑翦灭此而朝食！”不介马而驰之。",
        "story": "”春秋时，鲁成公二年的春天，齐顷公统率大军，进攻鲁国，接着又乘胜进攻卫国。鲁、卫两国都向晋国求援，晋景公就派郤(xì)克为中军主将，领兵前去抵抗齐军。六月间，晋国和鲁、卫两国的联军，挺进到靡笄山下（在今山东长清县境）。齐顷公却不把他们放在眼里，派人出阵挑战。齐将高固也冲进晋军，耀武扬威，回营后，还在全营各处走马兜圈，高叫：“欲勇者，贾余余勇！”接着双方约定：明天早晨决战。第二天，双方军队在鞌(ān)（今山东历城县境）列阵会战。齐顷公嚷道：“我们且歼灭了敌人再回来吃早饭！”他连战马身上的甲都不披，就冲出战斗。这一场战斗非常激烈，结果齐军却吃了败仗，骄傲的齐顷公险些被俘。齐顷公说的“歼灭了敌人再回来吃早饭”这句话，从藐视敌人、鼓励斗志来说，倒是句豪言壮语。后来，这句话变作“灭此朝食”，成为一句成语，以形容急于消灭敌人的心情和必胜的信心。“朝食”是吃早饭的意思。”",
        "character": [
            "齐顷公"
        ]
    },
    {
        "idiom": "木梗之患",
        "pingyin": "mù gěng zhī huàn",
        "explanation": "比喻客死他乡，不得复归故里。",
        "source": "《说苑·正谏》",
        "memo": "汉·刘向《说苑·正谏》：“今秦，四塞之国也，有虎狼之心，恐其有木梗之患。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "南橘北枳",
        "pingyin": "nán jú běi zhǐ",
        "explanation": "比喻同一物种因环境条件不同而发生变异。",
        "source": "《晏子春秋·内篇杂下》",
        "memo": "《晏子春秋·内篇杂下》：“橘生淮南则为橘，生于淮北则为枳，叶徒相似，其实味不同。所以然者何？水土异也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "宁戚饭牛",
        "pingyin": "níng qī fàn niú",
        "explanation": "表示求仕的愿望得以实现。",
        "source": "《吕氏春秋·举难》",
        "memo": "",
        "story": "宁戚为了在齐国谋得官职，在穷因无以自达时，喂牛车下，击打牛角而悲唱“商歌”，终于被齐桓公看中，能在齐国任事",
        "character": [
            "宁戚"
        ]
    },
    {
        "idiom": "排难解纷",
        "pingyin": "pái nàn jiě fēn",
        "explanation": "原指为人排除危难，解决纠纷。",
        "source": "《战国策·赵策三》",
        "memo": "《战国策·赵策三》：所贵于天下之士者，为人排患释难解纷乱而无取也。即有所取者，是商贾之人也，仲连不忍为也。",
        "story": "战国时代，秦国侵略赵国，兵临赵都邯郸。赵王求魏国援助，魏国派大将新垣衍劝说赵国尊秦王为帝，以换取秦国退兵。对此赵国大臣意见不一。这时齐国人鲁仲连正访问邯郸。他听说赵国要向秦国屈服，就去求见相平原君，情予引见新垣衍。平原君应允。鲁见新后，列举历史事实，分析当时形势，严厉斥责他“尊秦为帝”的谬论，并指出如果屈服了秦国，将对赵国、魏国都有极大的祸害。新垣衍听罢，十分钦佩，就撤回了原来的劝说，并表示立即返国回报魏王，秦军得了这个消息，不免大吃一惊，为防止意外，立刻退兵五十里。后来魏公子无忌窃符救赵，大败秦军，解除了这次秦国对赵国的入侵。平原君对鲁仲连又钦佩又感激，准备封地给他，他不肯受，送他千金为酬，他也不要。鲁仲连说：“所谓贵天下之上者，为人排患释难解纷乱而无取也。”",
        "character": [
            "新垣衍",
            "鲁仲连",
            "平原君"
        ]
    },
    {
        "idiom": "平易近人",
        "pingyin": "píng yì jìn rén",
        "explanation": "寓意人与人之间和蔼可亲、谦虚理解、没有架子。",
        "source": "《史记·鲁周公世家》",
        "memo": "西汉·司马迁《史记·鲁周公世家》：“平易近民，民必归之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "批亢捣虚",
        "pingyin": "pī gāng dǎo xū",
        "explanation": "比喻抓住敌人的要害乘虚而入。",
        "source": "《史记·孙子吴起列传》",
        "memo": "西汉·司马迁《史记·孙子吴起列传》：“救斗者不博戟，批亢捣虚，形格势禁，则自为解耳。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "披发左衽",
        "pingyin": "pī fā zuǒ rèn",
        "explanation": "借指异族入侵为主,现多指落后不文明的状态。",
        "source": "《论语·宪问》",
        "memo": "先秦·孔子《论语·宪问》：“微管仲，吾其被发左衽矣。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "齐大非偶",
        "pingyin": "qí dà fēi ǒu",
        "explanation": "指辞婚者表示自己门第或势位卑微，不敢高攀。",
        "source": "《左传·桓公六年》",
        "memo": "先秦·左丘明《左传·桓公六年》：“公之未昏于齐也，齐侯欲以文姜妻郑大子忽。大子忽辞，人问其故，大子曰：‘人各有耦，齐大，非吾耦也。’”",
        "story": "”春秋时代，齐僖公想把自己的女儿嫁给郑国的太子忽。太子忽推辞说：“每个人都有自己的配偶，齐国是个大国，不是我的配偶。后来北戎部落入侵齐国，齐国向郑国求援，太子忽率领郑国的军队，帮助齐国打败了北戎。齐僖公又提起这件事，太子忽坚决推辞。别人问他，他说：“以前没有帮齐国忙的时候，我都不敢娶齐侯的女儿。今天奉了父王之命来解救齐国之难，娶了妻子回去，这不是用郑国的军队换取自己的婚姻？郑国百姓会怎么说我！”就辞别而去。”",
        "character": [
            "齐僖公",
            "太子忽"
        ]
    },
    {
        "idiom": "齐人攫金",
        "pingyin": "qí rén jué jīn",
        "explanation": "比喻利欲熏心而不顾一切。",
        "source": "《列子·说符》",
        "memo": "战国·郑·列御寇《列子·说符》：“昔齐人有欲金者，清旦衣冠而之市，适鬻金者之所，因攫金而去。”",
        "story": "从前齐国有一个想要金子的人，（有一天）清早，他穿好衣服戴好帽子就去了集市。他去卖金子的地方时，正好看见别人买了金子，于是抢了那人的金子离开。衙役把他逮住了，当官的审问他：“人都在那儿，你还抢别人的金子，这是为什么?”齐人回答他说：“我抢金子的时候,没有看见人，只看见金子罢了。”",
        "character": []
    },
    {
        "idiom": "齐纨鲁缟",
        "pingyin": "qí wán lǔ gǎo",
        "explanation": "后亦泛指名贵的丝织品。",
        "source": "《谢敕赍纳袈裟启》",
        "memo": "南朝·梁·简文帝《谢敕赍纳袈裟启》：“荀针秦缕，因制缉而成文；鲁缟齐纨，藉馨浆而受彩。”唐·杜甫《忆昔》诗：“齐纨鲁缟车班班，男耕女桑不相失。”",
        "story": "管仲要求全国官员的衣服由齐国纨布改为的穿鲁国的缟布，导致缟布涨价，同时却禁止齐国百姓织缟布，却对鲁国开放，表面上鲁国大挣齐国缟布钱，但是鲁国因此全国全织缟布而放弃农业生产，一年后，齐国拒绝鲁国的缟布，而这时鲁国已经没有粮食了，不得不被迫签下尊从齐国的条约。",
        "character": [
            "管仲"
        ]
    },
    {
        "idiom": "犬兔之争",
        "pingyin": "quǎn tù zhī zhēng",
        "explanation": "比喻彼此相争，两败俱伤。",
        "source": "《战国策·齐策三》",
        "memo": "《战国策·齐策三》：“韩子卢者，天下之疾犬也；东郭逡者，海内之狡兔也。韩子卢逐东郭逡，环山者三，腾山者五，兔极于前，犬废于后，犬兔俱罢，各死其处。田父见之，无劳倦之苦而擅其功。”",
        "story": "”相传，韩子卢氏天下最上跑的狗，没有什么种类的狗会超过它，连骏马也赞叹。东郭逡是海内最有名的狡兔，它越壕沟，钻树洞，拐弯抹角，灵活自如，猛虎叼不走，饿狼吃不到。一天，韩子卢见到东郭逡，猛追不舍。韩子卢使出自己吃奶的力气，东郭逡用上自己所有的本事。它们绕山而跑环山三圈；它们腾山而奔，上下五次。折腾了半天，它们都累得气喘吁吁。韩子卢一停下，东郭逡也歇息；看见东郭逡歇息，子卢以为便宜可赚，猛然一跃，可是没叼着，东郭逡一闪身，逃走了。韩子卢又奋力追赶起来。东郭逡上坡，韩子卢也上；东郭逡滚下坡，韩子卢也滚；东郭逡环山奔跑半圈，倒在前面、韩子卢喘不过一口气，瘫在后面。田父看见了，把它们捡回家，烹狗蒸兔，美美的享受一顿。”",
        "character": []
    },
    {
        "idiom": "千虑一得",
        "pingyin": "qiān lǜ yì dé",
        "explanation": "愚蠢的人千百次考虑，总有一次正确。",
        "source": "《晏子春秋·杂下十八》",
        "memo": "《晏子春秋·杂下十八》:“婴闻之:圣人千虑,必有一失; 愚人千虑,必有一得。”",
        "story": "春秋时期，齐国相国晏婴为人正直为官清廉，生活非常俭朴。齐景公手下人亲眼目睹晏婴的贫困生活，就向齐景公汇报。齐景公派人送去千金给他接待宾客用。晏婴百般推辞不受说“圣人千虑，必有一失； 愚人千虑，必有一得。”。",
        "character": [
            "晏婴",
            "齐景公"
        ]
    },
    {
        "idiom": "千虑一失",
        "pingyin": "qiān lǜ yì shī",
        "explanation": "指聪明人的考虑，也会有不周到的地方",
        "source": "《晏子春秋·杂下十八》",
        "memo": "《晏子春秋·杂下十八》:“婴闻之:圣人千虑,必有一失; 愚人千虑,必有一得。”",
        "story": "春秋时期，齐国相国晏婴为人正直为官清廉，生活非常俭朴。齐景公手下人亲眼目睹晏婴的贫困生活，就向齐景公汇报。齐景公派人送去千金给他接待宾客用。晏婴百般推辞不受说“圣人千虑，必有一失； 愚人千虑，必有一得。”。",
        "character": [
            "晏婴",
            "齐景公"
        ]
    },
    {
        "idiom": "穷寇勿追",
        "pingyin": "qióng kòu wù zhuī",
        "explanation": "意思是不追无路可走的敌人，以免敌人情急反扑，造成自己的损失。",
        "source": "《孙子·军争》",
        "memo": "《孙子·军争》：“穷寇勿迫，此用兵之法也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "曲突徙薪",
        "pingyin": "qū tū xǐ xīn",
        "explanation": "比喻消除可能导致事故发生的因素，防患于未然。",
        "source": "《汉书霍光传》",
        "memo": "《汉书霍光传》:“人谓主人曰：‘乡(向)使听客之言，不费牛酒，终亡火患。今论功而请宾，曲突徙薪亡恩泽。”",
        "story": "”古时候，有一户人家建了一栋房子，许多邻居和亲友都前来祝贺，人们纷纷称赞这房子造得好。主人听了十分高兴。但是有一位客人，却诚心诚意地向主人提出：“您家厨房里的烟囱是从灶膛上端笔直通上去的，这样，灶膛的火很容易飞出烟囱，落到房顶上引起火灾。您最好改一改，在灶膛与烟囱之间加一段弯曲的通道。这样就安全多了。”顿了一顿，这个客人又说：“您在灶门前堆了那么多的柴草，这样也很危险，还是搬远一点好。”主人听了以后，认为这个客人是故意找茬出他的洋相，心里很不高兴。当然，也就谈不上认真采纳这些意见了。过了几天，这栋新房果然由于厨房的毛病起火了，左邻右舍，齐心协力，拼命抢救，才把火扑灭了。主人为了酬谢帮忙救火的人，专门摆了酒席，并把被火烧得焦头烂额的人请到上座入席。惟独没有请那位提出忠告的人。这就叫作：焦头烂额座上宾，曲突徙薪靠边站。”",
        "character": []
    },
    {
        "idiom": "人微权轻",
        "pingyin": "rén wēi quán qīng",
        "explanation": "指人的资历浅，威望低，权力不能使大家信服。",
        "source": "《史记·司马穰苴列传》",
        "memo": "《史记·司马穰苴列传》：“臣素卑贱，君擢之闾伍之中，加之大夫之上，士卒未附，百姓不信，人微权轻，愿得君之宠臣，国之所尊，以监军，乃可。”",
        "story": "春秋末期，齐国田完的后代穰苴因是婢妾所生而不被重用，在齐国受到晋国和燕国的侵略时，晏婴推荐穰苴给齐景公，被派去抵御晋军。他人微权轻，齐景公给他配了个权臣当监军。穰苴杀了这个傲慢的监军树立军威，收复了失地，被封为大司马",
        "character": [
            "穰苴",
            "晏婴",
            "齐景公"
        ]
    },
    {
        "idiom": "任人唯贤",
        "pingyin": "rèn rén wéi xián",
        "explanation": "只选任和提拔有德有才的人。",
        "source": "《尚书·咸有一德》",
        "memo": "《尚书·咸有一德》：“任官惟贤才，左右惟其人。”",
        "story": "”管仲回到鲁国后，与公子纠在庄公军队的保护下来继任君位。于是，齐、鲁之间发生了战争。结果鲁军大败，只得答应齐国的条件，将公子纠逼死，又把管仲抓起来。齐国的使者表示，管仲射过他们的国君，国君要报一箭之仇，非亲手杀了他不可，所以一定要将他押到齐国去。庄公也只好答应。 管仲被捆绑着，从鲁国押往齐国。一路上，他又饥又渴，吃了许多苦头。来到绮乌这个地方时，他去见那里守卫边界的官员，请求给点饭吃。不料，那守边界的官员竟跪在地上，端饭给管仲吃，神情十分恭敬。等管仲吃好饭，他私下问道：“如果您到齐国后，侥幸没有被杀而得封任用，您将怎样报答我？”管仲回答道：“要是照你所说的那样我得到任用，我将要任用贤人，使用能人，评赏有功的人。我能拿什么报答您呢？” 管仲被押到齐国都城后，鲍叔牙亲自前去迎接。后来齐桓公不仅没有对他报一箭之仇，反而任命他为相国，而鲍叔牙自愿当他的副手。原来，鲍叔牙知道管仲的才能大于自己，所以说服齐桓公这样做。”",
        "character": [
            "管仲",
            "齐桓公",
            "鲍叔牙"
        ]
    },
    {
        "idiom": "三令五申",
        "pingyin": "sān lìng wǔ shēn",
        "explanation": "多次命令和告诫，多指上级对下级，领导对群众。",
        "source": "《史记·孙子吴起列传》",
        "memo": "西汉·司马迁《史记·孙子吴起列传》：“约束既布，乃设鈇钺，即三令五申之”。",
        "story": "”春秋时候，著名军事学家孙武，携带自己写的《孙子兵法》去见吴王阖闾。吴王看过之后说：“你的十三篇兵法，我都看过了，能否拿我的军队试试？”孙武说可以。吴王再问：“用妇女来试验可以吗？”孙武也说可以。于是吴王召集一百八十名宫中美女，请孙武训练。孙武将她们分为两队，用吴王宠爱的两个宫姬为队长，并叫她们每个人都拿着长戟。队伍站好后，孙武便发问：“你们知道怎样向前向后和向左向右转吗？”众女兵说：“知道。”孙武再说：“向前就看我心胸；向左就看我左手；向右就看我右手；向后就看我背后。”众女兵说：“明白了。”于是孙武使命搬出铁钺（古时杀人用的刑具），三番五次向她们申戒。说完便击鼓发出向右转的号令。怎知众女兵不但没有依令行动，反而哈哈大笑。孙武见状说：“解释不明，交代不清，应该是将官们的过错。”于是又将刚才一番话详尽地再向她们解释一次。再而击鼓发出向左转的号令。众女兵仍然只是大笑。孙武便说：“解释不明，交代不清，是将官的过错。既然交代清楚而不听令，就是队长和士兵的过错了。”说完命左右随从把两个队长推出斩首。吴王见孙武要斩他的爱姬，急忙派人向孙武讲情，可是孙武说：“我既受命为将军，将在军中，君命有所不受！”遂命左右将两女队长斩了，再命两位排头的为队长。自此以后，众女兵无论是向前向后，向左向右，甚至跪下起立等复杂的动作都认真操练，再不敢儿戏了。”",
        "character": [
            "孙武",
            "吴王"
        ]
    },
    {
        "idiom": "三衅三沐",
        "pingyin": "sān xìn sān mù",
        "explanation": "多次沐浴并用香料涂身。",
        "source": "《国语·齐语》",
        "memo": "《国语·齐语》：“比至，三衅三沐之，桓公亲逆之于郊，而与之坐而问焉。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "散木不材",
        "pingyin": "sǎn mù bù cái",
        "explanation": "比喻没有用处的事物。",
        "source": "《内篇·人间世》",
        "memo": "《内篇·人间世》：已矣，勿言之矣！散木也，以为舟则沈，以为棺椁则速腐，以为器则速毁，以为门户则液樠，以为柱则蠹。是不材之木也，无所可用，故能若是之寿。",
        "story": "",
        "character": []
    },
    {
        "idiom": "视死如归",
        "pingyin": "shì sǐ rú guī",
        "explanation": "把死看得像回家一样平常。形容不怕牺牲生命。",
        "source": "《韩非子·外储说左下》",
        "memo": "《韩非子·外储说左下》：“三军既成阵，使士视死如归，臣不如公子成父。”《吕氏春秋·勿躬》：“三军之士，视死如归。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "上行下效",
        "pingyin": "shàng xíng xià xiào",
        "explanation": "上面的人怎么做，下面的人就学着怎么干。",
        "source": "《白虎通·三教》",
        "memo": "东汉·班固《白虎通·三教》：“教者，效也，上为之，下效之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "舍本逐末",
        "pingyin": "shě běn zhú mò",
        "explanation": "比喻做事不抓住主要的问题，而专顾细枝末节。",
        "source": "《吕氏春秋·上农》",
        "memo": "战国·吕不韦《吕氏春秋·上农》：“民舍本而事末则不令，不令则不可以守，不可以战。民舍本而事末则其产约，其产约则轻迁徙，轻迁徙则国家有患，皆有远志，无有居心。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "水深火热",
        "pingyin": "shuǐ shēn huǒ rè",
        "explanation": "比喻人民生活极端痛苦。",
        "source": "《孟子·梁惠王下》",
        "memo": "《孟子·梁惠王下》：“如水益深，如火益热。”",
        "story": "战国时，燕王哙改革国政，把君位让给相国子之，将军市被和公子平不服，起兵攻打子之，爆发内战。燕国大乱，齐国乘虚而入，齐宣王派大将匡章率兵十万攻燕。燕国百姓对内战不满，不愿出力抵抗齐军，出现“士卒不战，城门不闭”的局面，有些地方的燕国百姓反而给齐军送饭递水表示欢迎。匡章只用了五十天工夫，就攻下燕国国都。齐军攻占燕国后，并无撤回之意。匡章又不管束军队，士卒欺凌百姓，燕人纷纷起来反抗。这时，齐宣王向正在齐国游说的孟子请教，问道：“有人劝我不要吞并燕国，有人劝我吞并它，到底该怎么办?”孟子回答说：“如果吞并燕国，当地百姓反而很高兴，那就吞并它。古人有此先例，周武王便是。”“如果吞并燕国，当地百姓并不高兴，”孟子又说，“那就不要吞并它。古人也有先例，周文王便是。”孟子举了这两个例子后指出：“当初齐军攻入燕国，燕人送饭递水表示欢迎，那是因为燕国百姓想摆脱苦日子；而今如果齐国进而吞并燕国，给燕人带来亡国的灾难，使他们陷入水深火热之中，那他们必然会转而盼望别国来解救了!",
        "character": [
            "齐宣王",
            "孟子"
        ]
    },
    {
        "idiom": "随俗为变",
        "pingyin": "suí sú wéi biàn",
        "explanation": "是指顺随风俗而变化。",
        "source": "《史记·扁鹊仓公列传》",
        "memo": "《史记·扁鹊仓公列传》：“过洛阳，闻周人爱老人，即为耳目痹医；来入咸阳，闻秦人爱小儿，即为小儿医，随俗为变。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "束蕴请火",
        "pingyin": "shù yùn qǐng huǒ",
        "explanation": "比喻求助于人。也比喻为人排难解纷。",
        "source": "《韩诗外传》",
        "memo": "《韩诗外传》卷七：“里妇与里母相善。妇见疑盗肉，其姑去之，恨而告于里母，里母日：“安行。今令始呼汝。”即束蕴请火去妇之家，曰：‘吾犬争肉相杀，请火治之。’姑乃直使人追去妇还之”",
        "story": "",
        "character": []
    },
    {
        "idiom": "推己及人",
        "pingyin": "tuī jǐ jí rén",
        "explanation": "指设身处地替别人着想。",
        "source": "《论语·卫灵公》",
        "memo": "《论语·卫灵公》：“己所不欲，勿施于人”朱熹集注：“推己及物。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "田忌赛马",
        "pingyin": "tián jì sài mǎ",
        "explanation": "揭示如何善用自己的长处去对付对手的短处，从而在竞技中获胜的事例",
        "source": "《孙子吴起列传第五》",
        "memo": "",
        "story": "”齐国的大将田忌，很喜欢赛马，有一回，他和齐威王约定，要进行一场比赛。各自的马都可以分为上，中，下三等。比赛的时候，齐威王总是用自己的上马对田忌的上马，中马对中马，下马对下马。由于齐威王每个等级的马都比田忌的马强一些，所以比赛了几次，田忌都失败了。有一次，田忌又失败了，觉得很扫兴，比赛还没有结束，就垂头丧气地离开赛马场，这时，田忌抬头一看， 人群中有个人，原来是自己的好朋友孙膑。孙膑招呼田忌过来，拍着他的肩膀说： “我刚才看了赛马，威王的马比你的马快不了多少呀。” 孙膑还没有说完，田忌瞪了他一眼： “想不到你也来挖苦我！” 孙膑说：“我不是挖苦你，我是说你再同他赛一次，我有办法准能让你赢了他。” 田忌疑惑地看着孙膑： “你是说另换一匹马来？” 孙膑摇摇头说： “连一匹马也不需要更换。” 田忌毫无信心地说： “那还不是照样得输！”孙膑胸有成竹地说： “你就按照我的安排办事吧。” 齐威王屡战屡胜，正在得意洋洋地夸耀自己马匹的时候，看见田忌陪着孙膑迎面走来， 便站起来讥讽地说： “怎么，莫非你还不服气？” 田忌说：“当然不服气，咱们再赛一次！”说着，“哗啦”一声，把一大堆银钱倒在桌子上，作为他下的赌钱。 齐威王一看，心里暗暗好笑，于是吩咐手下，把前几次赢得的银钱全部抬来，另外又加了一千两黄金，也放在桌子上。齐威王轻蔑地说：“那就开始吧！” 一声锣响，比赛开始了。 孙膑先以下等马对齐威王的上等马，第一局田忌输了。齐威王站起来说： “想不到赫赫有名的孙膑先生，竟然想出这样拙劣的对策。” 孙膑不去理他。接着进行第二场比赛。孙膑拿上等马对齐威王的中等马，获胜了一局。 齐威王有点慌乱了。 第三局比赛，孙膑拿中等马对齐威王的下等马，又战胜了一局。这下，齐威王目瞪口呆了。 比赛的结果是三局两胜，田忌赢了齐威王。 还是同样的马匹，由于调换一下比赛的出场顺序，就得到转败为胜的结果。”",
        "character": [
            "田忌",
            "孙膑"
        ]
    },
    {
        "idiom": "贪小失大",
        "pingyin": "tān xiǎo shī dà",
        "explanation": "比喻只谋求眼前的好处而不顾长远的利益。",
        "source": "《吕氏春秋·权勋》",
        "memo": "战国 吕不韦《吕氏春秋·权勋》：“齐王怒曰：‘若残竖子之类，恶能给若金？’与燕人战，大败，达子死，齐王走莒。燕人逐北入国，相与争金于美唐甚多。此贪于小利以失大利者也。”",
        "story": "战国时期，秦惠文王想吞并物产丰富的蜀国，有人献计造能下金粪的石牛送给蜀侯。蜀侯中计，下令民工开山填谷，铺筑道路迎接石牛，秦惠文王让大军跟在运送石牛的队伍后灭了蜀国。人们嘲笑蜀侯是贪小利而失大利。",
        "character": [
            "秦惠文王"
        ]
    },
    {
        "idiom": "弹冠相庆",
        "pingyin": "tán guān xiāng qìng",
        "explanation": "比喻一个人做了官，其他人互相庆贺，将有官可做。",
        "source": "《汉书·王吉传》",
        "memo": "《汉书·王吉传》：“吉与贡禹为友，世称‘王阳在位，贡禹弹冠。’”",
        "story": "",
        "character": []
    },
    {
        "idiom": "螳臂当车",
        "pingyin": "táng bì dàng jū",
        "explanation": "比喻做力量做不到的事情，必然失败。",
        "source": "《庄子·人间世》",
        "memo": "《庄子·人间世》：“汝不知夫螳螂乎，怒其臂以当车辙，不知其不胜任也。”",
        "story": "春秋时，齐国的国君齐庄公，有一次坐着车子出去打猎，忽见路旁有一只小小的虫子，伸出两条臂膀似的前腿，要想来阻挡前进中的车轮。庄公问驾车的人：“这是一只什么虫子？”驾车的人答道：“这是一只螳螂，它见车子来了，不知赶快退避，却还要来阻挡，真是不自量力！”庄公笑道：“好一个出色的勇士，我们别伤害它吧！”说着，就叫驾车的人车子靠边，让开它，从路旁走过去。这件事情，很快就传开了。人们都说庄公敬爱勇士。便有好多勇敢的武士，纷纷来投奔他。但是，“螳臂当车”作为一句成语，却并不比喻出色的勇士，而是比作自不量力的可笑人物。",
        "character": [
            "齐庄公"
        ]
    },
    {
        "idiom": "堂堂正正",
        "pingyin": "táng táng zhèng zhèng",
        "explanation": "形容强大严整。光明磊落,正直。",
        "source": "《孙子·军争》",
        "memo": "《孙子·军争》：“无邀正正之旗，勿击堂堂之陈，此治变者也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "勿忘在莒",
        "pingyin": "wù wàng zài jǔ",
        "explanation": "比喻不忘本，不忘记曾经的艰苦岁月。",
        "source": "《吕氏春秋·直谏》",
        "memo": "《吕氏春秋·直谏》：“使公毋忘出奔于莒也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "物以类聚",
        "pingyin": "wù yǐ lèi jù",
        "explanation": "指坏人彼此臭味相投，勾结在一起。",
        "source": "《周易·系辞上》",
        "memo": "《周易·系辞上》：“方以类聚，物以群分。”。指同类的东西常聚在一起。中性词。现多比喻坏人和坏人常在一起，也作物以类聚、人以群分，方以类聚、物以群分。物各有畴。主谓式：物||以类聚。",
        "story": "",
        "character": []
    },
    {
        "idiom": "亡戟得矛",
        "pingyin": "wáng jǐ dé máo",
        "explanation": "比喻得到的和失去的相当，或有失有得。",
        "source": "《吕氏春秋·离俗》",
        "memo": "《吕氏春秋·离俗》：“亡戟得矛，可以归乎？”",
        "story": "鞍（春秋时属齐，今山东济南市）之战是《左传》中最著名的战役之一，发生在鲁成公二年（公元前589年）。开始时，齐军小胜。齐侯误以为晋军怯弱，不堪一击，命令士兵打败晋军后，再吃早饭战役开始时，一个齐军战士落在大队人马后，正在手握长戟向前猛冲，突然从侧面杀出两名晋军拦住去路。齐军士兵独自一人毫不畏惧，将长戟抡动如飞，猛刺晋军。两名晋军奋勇对敌，一前一后用长予与齐军格斗。双方经过一番苦斗，齐军士兵终是单人不敌四手，手中长戟被晋军打掉了。齐军没了兵刃，转身逃去。两名晋军表现得十分仁义大度，他们不屑追杀失去兵器的勇士，掉头奔向大战场。齐军士兵逃跑时发现草丛中有战死士兵丢弃的长矛，他顺手抄起来准备重新参战。他向前跑了几步，猛然想起，战场上丢失兵器，按齐军军法是要受惩处的。他开始犹豫起来，不知如何是好。正在访径无计的时候，他发现远处有个人影向他缓缓走来。他想：“应该向别人请教一番，该如何摆脱困境。”齐军士兵急忙向来人跑去，跑至近前一看，来人像个读书人。齐军士兵心中大喜，立在路旁，向来人抱拳行礼，然后恭敬地问道：“请问先生，我在作战时失掉大戟，但又抬到一条长矛，您看，我还会受到惩罚吗？”读书人觉得这不是个问题，就不假思索地说：“戟是兵器，矛也是兵器，丢了戟，得到一条矛（亡戟得矛）得失相当嘛，不会受处罚的。”读书人说完，头也不回地走了。齐军士兵仍然不放心，他认为，一个书生哪里会懂军中法规，摇摇头，叹口气，仍感到十分为难。他心情沮丧地站在原地发呆。突然，他隐隐听到远处传来阵阵銮铃声响。原来是镇守高唐的齐国大夫经过这里。齐军士兵向大夫报告了亡戟得矛的过程，然后问，是否可以回营。齐大夫大怒，训斥道：“戟是戟，矛是矛，两者不能相抵，你等着受军法惩处吧。”这位士兵不愿受军法惩治，此时战事齐军渐渐不支，纷纷后退。这位齐军却坚持作战。他的同伴劝他一同逃命，他悲壮地说：“与其回去受军法处置而死，还不如多杀几个敌人，战死沙场乃是战士的本色。”他说完，抱着必死的决心返身投入战斗，直至战死。",
        "character": []
    },
    {
        "idiom": "围魏救赵",
        "pingyin": "wéi wèi jiù zhào",
        "explanation": "现借指用包抄敌人的后方来迫使他撤兵的战术。",
        "source": "《史记·孙子吴起列传》",
        "memo": "",
        "story": "战国时（公元前353年） 魏国围攻赵国都城邯郸。赵国求救于齐国。齐将田忌、孙膑率军救赵 ，趁魏国都城兵力空虚，引兵直攻魏国。魏军回救，齐军乘其疲惫，于中途大败魏军，遂解赵围。",
        "character": [
            "田忌",
            "孙膑"
        ]
    },
    {
        "idiom": "文能附众",
        "pingyin": "wén néng fù zhòng",
        "explanation": "政治上能团结部下",
        "source": "《史记·司马穰苴列传》",
        "memo": "《史记·司马穰苴列传》：“晏婴乃荐田穰苴曰：‘穰苴虽田氏庶孽，然其人文能附众，武能威敌，愿君试之。’”",
        "story": "",
        "character": []
    },
    {
        "idiom": "武能威敌",
        "pingyin": "wǔ néng wēi dí",
        "explanation": "在军事上能威震敌人",
        "source": "《史记·司马穰苴列传》",
        "memo": "《史记·司马穰苴列传》：“晏婴乃荐田穰苴曰：‘穰苴虽田氏庶孽，然其人文能附众，武能威敌，愿君试之。’”",
        "story": "",
        "character": []
    },
    {
        "idiom": "宣王好射",
        "pingyin": "xuān wáng hǎo shè",
        "explanation": "现指好大喜功的人",
        "source": "《汉书 · 尹文子》",
        "memo": "",
        "story": "”齐宣王爱好射箭，喜欢别人夸耀他能够拉开强弓，其实他使的弓只用三石的力气就能够拉开了。 他把这张弓交给左右的人传看。身边的人都试着拉，但只把弓拉到一半，就装着拉不动的样子，恭维地说：“这张弓没有九石的力气拉不开。除了大王以外，谁还能够使用这张弓呢？” 齐宣王听了非常高兴。其实，齐宣王使用的弓不过三百多斤，可是他却一辈子以为自己能拉一千多斤的弓。这难道不是悲哀吗？三百多斤是真实的，一千多斤是徒有其名，齐宣王喜欢的是徒有虚名，而失去了真实的水平”",
        "character": [
            "齐宣王"
        ]
    },
    {
        "idiom": "一鸣惊人",
        "pingyin": "yì míng jīng rén",
        "explanation": "比喻平时很一般，突然做出惊人的事情。",
        "source": "《史记 滑稽列传》",
        "memo": "《史记 滑稽列传》：“此鸟不飞则已，一飞冲天：不鸣则已，一鸣惊人。”",
        "story": "”有一天，淳于髡见到了齐威王，就对他说：“大王，为臣有一个谜语想请您猜一猜：其国有只大鸟，住在大王的宫廷中，已经整整三年了，可是他既不振翅飞翔，也不发生鸣叫，只是毫无目的的蜷缩着，大王您猜，这是一只什么鸟呢？”齐威王本是一个聪明人，亦听就知道淳于髡是在讽刺自己，向那只大鸟一样，身为一国之尊，却毫无作为，只知道享乐。而他时再也不是一个昏庸的君王，于是沉吟了一会儿之后便毅然的决定要改过，振作起来，做一番轰轰烈烈的是，因此他对淳于髡说：“嗯，这一只大鸟，你不知道，它不飞则已，一飞就会冲到天上去，它不鸣则已，一鸣就会惊动众人，你慢慢等着瞧吧！”从此齐威王不在沉迷于饮酒作乐，而开始整顿国政。首先他召见全国的官吏，尽忠负责的，就给予奖励；而那些腐败无能的，则加以惩罚。结果全国上下，很快就振作起来，到处充满蓬勃的朝气。另一方面他也着手整顿军事，强大武力，奠定国家的威望。各国诸侯听到这个消息以后都很震惊，不但不敢再来侵犯，甚至还把原先侵占的土地，都归还给齐国。”",
        "character": [
            "齐威王",
            "淳于髡"
        ]
    },
    {
        "idiom": "一匡天下",
        "pingyin": "yì kuāng tiān xià",
        "explanation": "意指使天下的一切事情都得到纠正",
        "source": "《论语·宪问》",
        "memo": "《论语·宪问》：“管仲相桓公，霸诸侯，一匡天下，民到于今受其赐。微管仲，吾其被发左祍矣。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "一箭之仇",
        "pingyin": "yí jiàn zhī chóu",
        "explanation": "现比喻与他人有仇恨",
        "source": "",
        "memo": "",
        "story": "”不久，襄公被杀，另立新君。第二年，大臣们又杀了新君，派使者到鲁国去迎回公子纠当齐国国君，鲁庄公亲自带兵护送公子纠回国。管仲怕逃亡在莒国的公子小白因离齐国近，抢先回国夺到君位。所以经庄公同意，先带领一支人马去拦截公子小白。果然，管仲的队伍急行到即墨附近时，发现公子小白正在赶往齐国，便上前说服他不要去。但是，小白坚持要去。于是管仲偷偷向小白射了一箭。管仲以为他已被射死，便不慌不忙地回鲁国去护送公子纠回齐国。不料，公子小白并未被射死，反而赶在管仲和公子纠之前回到了齐国都城，说服大臣们迎立公子小白为国君，这就是后来的齐桓公。于是，齐、鲁之间发生了战争。结果鲁军大败，只得答应齐国的条件，将公子纠逼死，又把管仲抓了起来。齐国的使者表示，管仲射过他们的国君，国君要报一箭之仇，非亲手杀了他不可，于是管仲被捆绑着，从鲁国押往齐国。行至绮乌，守卫边界的官员竟跪在地上，端饭给管仲吃，神情十分恭敬。等管仲吃好饭，他私下问道：“如果您到齐国后，侥幸没有被杀而得到任用，您将怎样报答我?”管仲回答道：“要是照你所说的那样我得到任用，我将要任用贤人，使用能人，评赏有功的人。我又怎么能拿什么来报答您呢?”管仲被押到齐国都城后，鲍叔牙亲自前去迎接。后来齐桓公不仅没有对他报一箭之仇，反而任命他为相国，而鲍叔牙自愿当他的副手。”",
        "character": [
            "管仲",
            "齐桓公",
            "鲍叔牙"
        ]
    },
    {
        "idiom": "一曝十寒",
        "pingyin": "yí pù shí hán",
        "explanation": "比喻学习或工作一时勤奋，一时又懒散，没有恒心",
        "source": "《孟子·告子上》",
        "memo": "《孟子·告子上》：“虽有天下易生之物也，一日暴之，十日寒之，未有能生者也。”",
        "story": "”孟子对齐王的昏庸，作事没有坚持性、轻信奸佞谗言很不满，便不客气的对他说：“王也太不明智了，天下虽有生命力很强的生物，假如把它放在太阳下晒十天，然后再把它放在阴冷的地方冻十天，即使是生命力再强的植物也会死。我见到齐王的机会少之甚少，即使给了他些良好的影响与帮助，我一离开，一些和我主张不同的人，又带给他许多不好影响。我怎么能使齐王的思想、品质好起来呢？”按着，他使打了一个生动的比喻：“下棋看起来是件小事，但假使你不专心致志，也同样学不好，下不赢，奕秋是全国最善下棋的能手，他教了两个徒弟，其中一个专心致志，处处听奕秋的指导；另一个却老是认为有大天鹅飞来，准备用箭射鹅。两个徒弟是一个师傅教的，一起学的，然而后者的成绩却差得很远。这不是他们的智力有什么区别，而是专心的程度不一样啊；””",
        "character": [
            "孟子",
            "齐王"
        ]
    },
    {
        "idiom": "一傅众咻",
        "pingyin": "yí fù zhòng xiū",
        "explanation": "形容由于环境的干扰，做事难于取得成绩。",
        "source": "《孟子·滕文公下》",
        "memo": "《孟子·滕文公下》：“一齐人傅之，众楚人咻之，虽日挞而求齐也，不可得矣。”",
        "story": "”有一年，孟子听说宋国的君王说要施行仁政，这正是孟子所竭力主张的，所以他特地到宋国去。　　孟子在宋都彭城了解了一件事情，发现宋国君主手下的贤臣很少，而没有德才的人却很多。他感到情况并不是像宋国国君说的那样，便打算到别国去游历。宋国的君主听说孟子要离去，便派大臣戴不胜去挽留，并向他请教治理国家的方法。戴不胜说：“请问先生，怎样才能使我们宋国的君王贤明?”　　孟子回答说：“先生要使贵国的君王贤明吗?我可以明白地告诉您。不过，还是让我先讲一件事。楚国有位大夫。想让自己的儿子学会齐国话。据您看，应该请齐国人来教他呢，还是请楚国人来教他?”　　戴不胜不加思索他说：“当然是请齐国人来教他。”　　孟子点点头，说：“是的，那位大夫请了一个齐国人，来教儿子齐国话，可是儿子周围有许多楚国人整天在打扰他，同他吵吵嚷嚷。在这样的环境中，就是用鞭子抽他、骂他、逼他；他也学不会齐国话。如果那位大夫不是这样做，而是将儿子带到齐国去，让他在齐国都城临淄的闹市住几年，那么齐国话很快就会学好。即使你不让他说齐国活，甚至用鞭子拍打他，强迫他说楚国话，也办不到。”　　戴不胜打断孟子的话说：“我们宋国也有薛居州那样的贤土呀！”孟子回答说：“是的，宋国的薛居州是位清廉的大夫。但是靠他一个人在君王左右是不起什么作用的。如果君王左右的人，无论年老处少、官职尊卑，都能象薛居州一样，那才行呢。君王左右都不是好人，那君王能与谁去做好事呢？”　　戴不胜向君王复命后，君王见孟子去意已决，便不再强留，送了他一些钱，让他离开宋国”",
        "character": [
            "孟子",
            "戴不胜"
        ]
    },
    {
        "idiom": "一鼓作气",
        "pingyin": "yì gǔ zuò qì",
        "explanation": "意思是作战是靠士兵的勇气的。",
        "source": "《左传·庄公十年》",
        "memo": "《左传·庄公十年》：“夫战，勇气也。一鼓作气，再而衰，三而竭。”",
        "story": "”鲁庄庄公十年的春天，齐国军队攻打鲁国，鲁庄公将要迎战。曹刿请求庄公召见他。他的同乡说:“大官们会谋划这件事的，你又何必参与呢?”曹刿说:“大官们眼光短浅，不能深谋远虑。”于是他进宫去见庄公。曹刿问庄公:“您凭什么跟齐国打仗?”庄公说:“衣食是使人生活安定的东西，我不敢独自占有，一定拿来分给别人。”曹刿说:“这种小恩小惠不能遍及百姓，老百姓是不会听从您的。”庄公又说:“祭祀用的牛羊、玉帛之类，我从来不敢虚报数目，一定要做到诚实可信。”曹刿说:“这点诚意难以使人信服，神明是不会保佑您的。”庄公接着说:“大大小小的案件，虽然不能件件都了解得清楚，但一定要处理得合情合理。”曹刿说:“这才是尽本职的事，可以凭这一点去打仗。作战时请允许我跟您一起去。”鲁庄公和曹刿同乘一辆战车，在长勺和齐军作战。庄公刚上战场就要击鼓进军，曹刿说:“现在不行。”齐军擂鼓三次之后，曹刿说:“可以击鼓进军了。”结果，齐军大败。庄公正要下令追击，曹刿说:“还不行。”说完就下车去察看齐军的车印，然后又登上车，手扶车前横木观望齐军的队形。仔细观察一番后，他说:“现在可以追击了。”于是，庄公命令军队追击齐军。最终，鲁国的军队战胜了齐军，鲁庄公向曹刿询问取胜的原因。曹刿答道:“打仗，要靠勇气。第一次擂鼓能振作士兵们的勇气。第二次擂鼓时，士兵们的勇气就会减弱。等到第三次擂鼓时，士兵们的勇气已经枯竭了。敌方的勇气已经枯竭而我方的勇气正盛，所以我们打败了他们。”",
        "character": [
            "曹刿",
            "鲁庄公"
        ]
    },
    {
        "idiom": "易如反掌",
        "pingyin": "yì rú fǎn zhǎng",
        "explanation": "比喻事情很简单非常容易完成。",
        "source": "《上书谏吴王》",
        "memo": "汉 枚乘《上书谏吴王》：“必若所欲为，危于累卵，难于上天；变所欲为，易如反掌，安于泰山。”",
        "story": "战国时期大思想家主张推行“仁政”、“王道”，他的弟子公孙丑问他到齐国去能否像管仲、晏婴一样有所作为。孟子很不高兴，说：“管仲辅佐齐桓公，晏婴辅佐齐景公，是因为齐国地广人多，推行王道统一天下就像翻转手掌那样容易。”",
        "character": [
            "孟子"
        ]
    },
    {
        "idiom": "易牙蒸子",
        "pingyin": "yì yá zhēng zǐ",
        "explanation": "为长官发财，将自己的儿子蒸了献给齐王",
        "source": "《管子·小称》",
        "memo": "《管子·小称》。文曰：“夫易牙者，以调和事公。 公曰：‘惟蒸婴儿未尝。’于是蒸其首子而献之公。”",
        "story": "齐国有一个管理齐桓公烹饪的厨师易牙。桓公久居宫中，什么珍馐佳肴、山珍海味都吃腻了，有一次半开玩笑地对易牙说：“我就是蒸婴儿的肉没有吃过。”易牙为了满足桓公的欲望，将自己的三岁儿子蒸了献给了桓公吃，桓公认为他对自己忠心耿耿，于是提拔重用了易牙，易牙便成为宠臣。后来大臣管仲生病，齐桓公前去探望，并问管仲：“君将何以教我？”仲曰：“君勿近易牙和竖刁”。桓公说：“易牙烹子飨我，还不能信任吗？”管仲说“人无不爱其子，自己的儿子尚且不爱，焉能爱君”。直到管仲死后，桓公仍不信其言。不久齐桓公病危，易牙果然拥立齐桓公的宠妾卫共姬的儿子作乱，闭塞宫门，桓公被活活气死在病榻上。",
        "character": [
            "易牙",
            "齐桓公"
        ]
    },
    {
        "idiom": "以羊易牛",
        "pingyin": "yǐ yáng yì niú",
        "explanation": "意思是比喻用这个代替另一个。",
        "source": "《孟子·梁惠王上》",
        "memo": "《孟子·梁惠王上》：王坐于堂上，有牵牛而过堂下者，曰：“何可废也，以羊易之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "以民为本",
        "pingyin": "yǐ mín wéi běn",
        "explanation": "认为万民百姓是国家的根本。治国应以安民、得民作为根本。",
        "source": "《尚书·五子之歌》",
        "memo": "《尚书·五子之歌》：“民惟邦本，本固邦宁。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "以人为本",
        "pingyin": "yǐ rén wéi běn",
        "explanation": "体恤民意,了解民情",
        "source": "《管子·霸言篇》",
        "memo": "《管子·霸言篇》：“夫霸王之所始也，以人为本。本理则国固，本乱则国危。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "以法治国",
        "pingyin": "yǐ fǎ zhì guó",
        "explanation": "国家的权威要集中，政令要统一。靠法律来治理国家就很容易",
        "source": "《管子.明法》",
        "memo": "《管子.明法》：“威不两错，政不二门。以法治国则举错而已。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "以管窥天",
        "pingyin": "yǐ guǎn kuī tiān",
        "explanation": "从小孔或缝隙里看。通过竹管子的孔看天。",
        "source": "《庄子·秋水》",
        "memo": "战国·宋·庄周《庄子·秋水》：“是直用管窥天，用锥指地也，不亦小乎？”",
        "story": "",
        "character": []
    },
    {
        "idiom": "以逸待劳",
        "pingyin": "yǐ yì dài láo",
        "explanation": "多指作战时采取守势，养精蓄锐，让敌人来攻，然后乘其疲劳，战而胜之。",
        "source": "《孙子·军争》",
        "memo": "《孙子·军争》：“以近待远，以佚待劳，以饱待饥，此治力者也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "倚门倚闾",
        "pingyin": "yǐ mén yǐ lǘ",
        "explanation": "现指形容父母盼望子女归来的迫切心情。",
        "source": "《战国策·齐策六》",
        "memo": "《战国策·齐策六》：“女朝出而晚来，则吾倚门而望，女暮出而不还，则吾倚闾而望。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "因势利导",
        "pingyin": "yīn shì lì dǎo",
        "explanation": "顺着事情发展的趋势，向有利于实现目的的方向加以引导。",
        "source": "《史记·孙子吴起列传》",
        "memo": "西汉·司马迁《史记·孙子吴起列传》：“善战者，因其势而利导之。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "晏子使楚",
        "pingyin": "yàn zǐ shǐ chǔ",
        "explanation": "齐国大夫晏子出使楚国的故事。",
        "source": "《晏子春秋》",
        "memo": "",
        "story": "”晏子将要出使楚国。楚王听到这个消息，对左右的人（近侍）说：“晏婴是齐国的熟悉言辞的人，现在将要来了，我想羞辱他，用什么办法呢？左右的人回答说：“在他来的时候，请允许我们绑一个人从大王您面前走过。大王问，‘这是什么国家的人？’（我们）回答说，‘是齐国人。’大王说，‘他犯了什么罪？’我们说，‘犯了偷窃罪。’”　　晏子到了，楚王赏赐给晏子酒，酒喝得正高兴的时候，两个官吏绑着一个人走到楚王面前。楚王问：“绑着的人是什么国家的人？”（近侍）回答说：“（他）是齐国人，犯了偷窃罪。”楚王瞟着晏子说：“齐国人本来就善于偷窃吗？”晏子离开座位回答说：“我听说这样的事：橘子生长在淮河以南就是橘子，生长在淮河以北就变成枳了，只是叶子的形状相像，它们果实的味道不同。这样的原因是什么呢？是水土不同。现在老百姓生活在齐国不偷窃，到了楚国就偷窃，莫非楚国的水土使得老百姓善于偷窃吗？”楚王笑着说：“圣人不是能同他开玩笑的人，我反而自讨没趣了。””",
        "character": [
            "晏婴",
            "楚王"
        ]
    },
    {
        "idiom": "言归于好",
        "pingyin": "yán guī yú hǎo",
        "explanation": "指彼此重新和好。",
        "source": "《左传·僖公九年》",
        "memo": "《左传·僖公九年》：“凡我同盟之人，既盟之后，言归于好。”",
        "story": "”春秋战国时期，诸侯争霸，战争连年不断。齐桓公建立霸业后，为了重修诸侯之好，于公元前651年在葵丘召开结盟会议，史称“葵丘会盟”。参与会议的诸侯国有鲁、亲、卫、郑、许、曹等。在结盟大会上，诸侯国各抒已见，经过激烈的争论，最终达成了一决议：第一，不得阻塞水源；第二，不得阻挠粮食的流通；第三，要尊贤育才，选拔贤士，不得世袭官职。盟会结束时，齐桓公最后要求：“凡是参加同盟的各国，大家订立了盟约之后，一定要遵照执行，消除过去的隔阂，重新友好相处。”后来，人们用“言归于好”来表示重新和好。”",
        "character": [
            "齐桓公"
        ]
    },
    {
        "idiom": "泱泱大风",
        "pingyin": "yāng yāng dà fēng",
        "explanation": "指气魄宏大的大国风度。",
        "source": "《左传·襄公二十九年》",
        "memo": "《左传·襄公二十九年》：“美哉，泱泱乎，大风也哉！表东海者，其大公乎！国未可量也。”",
        "story": "春秋时期，吴国的公子季札自幼精通音乐，他访问鲁国时，鲁国特地为他举行一场演出。鲁国的乐工演奏周王朝及诸侯国的乐曲，他对齐国歌曲说：“美哉，泱泱乎，大风也哉！”等演奏曹国、郐国的《郐风》以后，他就没有再表示意见了。",
        "character": [
            "季札"
        ]
    },
    {
        "idiom": "有恃无恐",
        "pingyin": "yǒu shì wú kǒng",
        "explanation": "因为有所倚仗而毫不害怕，或毫无顾忌。",
        "source": "《左传·僖公二十六年》",
        "memo": "《左传·僖公二十六年》：“室如悬罄，野无青草，何恃而不恐？”",
        "story": "",
        "character": []
    },
    {
        "idiom": "踊贵屦贱",
        "pingyin": "yǒng guì jù jiàn",
        "explanation": "后用以比喻世态失常，社会现象不合理。",
        "source": "《左传·昭公三年》",
        "memo": "《左传·昭公三年》：“国之诸市，屦贱踊贵，民人痛疾。”",
        "story": "晏子当了相国，景公对晏子说：“你的住宅靠近集市，吵闹灰尘多，我给你换个住处吧。”晏子推辞说：“别人能住，我也可以住，要不有人会说我奢侈。而且靠近集市，买东西还方便，多好。”景公笑着说：“你也知道集市里的贵贱？”晏子说：“是呀！既然有利，怎么敢不了解呢”景公说：“最近什么东西卖得贵，什么东西卖得贱？”晏子说：“假脚卖得贵，鞋卖得便宜。”景公很吃惊，于是免去了刖刑（砍去脚的刑罚）。",
        "character": [
            "晏婴",
            "齐景公"
        ]
    },
    {
        "idiom": "余音绕梁",
        "pingyin": "yú yīn rào liáng",
        "explanation": "现亦形容激动人心的话语给人留下深刻的印象。",
        "source": "《列子·汤问》",
        "memo": "《列子·汤问》：“昔，韩娥东之齐，匮粮，过雍门，鬻歌假食，既去而余音绕梁，三日不绝，左右以其人弗去。”",
        "story": "我国古时有一位善歌者韩娥，韩国人。一次她经过齐国，因路费用尽，便在齐国都城（临淄，今属山东）的雍门卖唱筹资。韩娥声音清脆嘹亮，婉转悠扬，十分动人。这次演唱，轰动全城。唱完以后，听众还聚在雍门，徘徊留恋，不肯散去。",
        "character": [
            "韩娥"
        ]
    },
    {
        "idiom": "绕梁三日",
        "pingyin": "rào liáng sān rì",
        "explanation": "现亦形容激动人心的话语给人留下深刻的印象。",
        "source": "《列子·汤问》",
        "memo": "《列子·汤问》：“昔，韩娥东之齐，匮粮，过雍门，鬻歌假食，既去而余音绕梁，三日不绝，左右以其人弗去。”",
        "story": "我国古时有一位善歌者韩娥，韩国人。一次她经过齐国，因路费用尽，便在齐国都城（临淄，今属山东）的雍门卖唱筹资。韩娥声音清脆嘹亮，婉转悠扬，十分动人。这次演唱，轰动全城。唱完以后，听众还聚在雍门，徘徊留恋，不肯散去。",
        "character": []
    },
    {
        "idiom": "余勇可贾",
        "pingyin": "yú yǒng kě gǔ",
        "explanation": "比喻剩下的勇气和力量很足，还有勇气可以使出来。",
        "source": "《左传·成公二年》",
        "memo": "春秋·左丘明《左传·成公二年》：“齐高固入晋师，桀石以投人，禽之而乘其车，系桑本焉，以徇齐垒，曰‘欲勇者贾余余勇。’”　",
        "story": "”春秋时，齐国攻打鲁国和卫国。晋国为了援助鲁国和卫国，派克统率晋军，会合鲁、卫两国军队，进入齐国境内。齐军中有一员十分勇猛的大将，名叫高固。两军一交锋，高固自己单独驾了一辆战车，直冲晋营，用大石头逢人就砸。迎面来了一个驾着战车的晋军将官，高固举起一块大石头突然向他砸去。那个将官没有防备，被石头击中，身负重伤，倒在车上。高固乘机跳上对方战车，押着他飞奔回营。高固立了战功，想显露一下自己的威风，便在战车后面系上一棵桑树，在齐营里跑了一圈。他一边驾着战车跑，一边洋洋得意地高喊：“谁需要勇气，快来买啊！我还剩下很多的勇气没有用完，可以卖给别人（欲勇者，贾余馀勇）！””",
        "character": [
            "高固"
        ]
    },
    {
        "idiom": "与民同乐",
        "pingyin": "yǔ mín tóng lè",
        "explanation": "后泛指领导与群众一起游乐，共享幸福。",
        "source": "《梁惠王上》",
        "memo": "《梁惠王上》：“古之人与民偕乐，故能乐也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "缘木求鱼",
        "pingyin": "yuán mù qiú yú",
        "explanation": "比喻方向或办法不对头，不可能达到目的。",
        "source": "《孟子·梁惠王上》",
        "memo": "《孟子·梁惠王上》：“以若所为，求若所欲，犹缘木而求鱼也。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "早出晚归",
        "pingyin": "zǎo chū wǎn guī",
        "explanation": "出去得很早，回来得很晚，形容辛勤工作。",
        "source": "《战国策·齐策六》",
        "memo": "《战国策·齐策六》：“女朝出而晚来，则吾倚门而望。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "尊贤尚功",
        "pingyin": "zūn xián shàng gōng",
        "explanation": "尊重贤者，崇尚武功，指积极开疆阔土，南征北战的意思.",
        "source": "《淮南子·齐俗训》",
        "memo": "《淮南子·齐俗训》：“周初大分封之后，姜尚问周公姬旦：“您怎样治理鲁国？”“尊尊而亲亲。”姬旦道，又问姜尚：“您如何来治理齐国？”姜尚直言相告：“尊贤而尚功。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "邹缨齐紫",
        "pingyin": "zōu yīng qí zǐ",
        "explanation": "比喻上行下效。",
        "source": "《韩非子·外储说左上》",
        "memo": "《韩非子·外储说左上》：於是日郎中莫衣紫，其明日国中莫衣紫，三日境内莫衣紫也。”又：“ 邹君 好服长缨，左右皆服长缨，缨甚贵， 邹君 患之，问左右，左右曰：‘君好服，百姓亦多服，是以贵。’君因先自断其缨而出，国中皆不服长缨。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "凿楹纳书",
        "pingyin": "záo yíng nà shū",
        "explanation": "谓藏守书籍以传久远。",
        "source": "《晏子春秋·杂下三十》",
        "memo": "《晏子春秋·杂下三十》：“ 晏子 病，将死，凿楹纳书焉。谓其妻曰：‘楹语也，子壮而示之。’”",
        "story": "",
        "character": []
    },
    {
        "idiom": "知己知彼",
        "pingyin": "zhī jǐ zhī bǐ",
        "explanation": "对敌我双方的优劣短长均能透彻了解。",
        "source": "《孙子·谋攻》",
        "memo": "《孙子·谋攻》：“知己知彼，百战不殆。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "百战不殆",
        "pingyin": "bǎi zhàn bú dài",
        "explanation": "经历许多次战役，都没有遭到危险。形容善于用兵。",
        "source": "《孙子·谋攻》",
        "memo": "《孙子·谋攻》：“知己知彼，百战不殆。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "直言不讳",
        "pingyin": "zhí yán bú huì",
        "explanation": "说话坦率，毫无顾忌。",
        "source": "《晋书 刘波传》",
        "memo": "《晋书 刘波传》：“臣鉴先征，窃惟今事，是以敢肆狂瞽，直言无讳。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "趾高气扬",
        "pingyin": "zhǐ gāo qì yáng",
        "explanation": "走路时脚抬得很高，神气十足。形容骄傲自满，傲视别人。",
        "source": "《左传·桓公十三年》",
        "memo": "《左传·桓公十三年》：“楚屈瑕伐罗，斗伯比送之，还，谓甚御曰：‘莫敖必败，举趾高，心不固矣。’”《史记·管偃列传》也载：“拥大盖，策驷马，意气扬扬，甚自得也。”",
        "story": "战国时期，齐国孟尝君出使楚国，楚王送他珍贵的象床，负责送象床的登徒去游说孟尝君的门人公孙戍，希望能劝止这项差使。公孙戍说动孟尝君不接受这件宝物。孟尝君见他出门时趾高气扬的样子觉得奇怪，原来他得到登徒的一把宝剑。[2]  春秋时，楚国有个叫屈瑕的将军，是个专门重视外貌，不学无术的人，只要稍有点成就，就很骄傲、自满。有一次，他打败了骠悍的绞国，凯旋，从此骄傲自得，从不把其它的朝臣放在眼中。第二年，屈瑕又奉命要去打罗国，有一个叫做斗伯比的将军前往送行。当斗伯比回来时，悄悄的对车夫说：“屈将军这次一定会打败仗；因为我看他走路的样子，脚步一昂一翘的，便知道他的心并没有真正的用在作战上，而是去吓唬敌人的，这样子怎么能打胜仗呢？”斗伯比说完，沉思了一下，就进宫去见楚王，要楚王立刻派兵去接应。楚王不相信，回到后宫将这件事告诉了宠妃邓曼，邓曼认为斗伯比的见解很对，应该派兵救援。楚王听了，立即派大军前去，希望能够挽回局势。但是，战事已经发生，屈瑕因为轻敌而不设防，被罗国和卢国两面夹攻，而一败涂地，只好自杀谢罪。",
        "character": [
            "孟尝君",
            "楚王"
        ]
    },
    {
        "idiom": "志在四方",
        "pingyin": "zhì zài sì fāng",
        "explanation": "即指有远大的志向。",
        "source": "《孔丛子·儒服》",
        "memo": "《孔丛子·儒服》：“人生则有四方之志”",
        "story": "孔子第五代孙孔穿，字子高，出游赵国（今河北省南部一带）。在赵国，他和赵胜（即平原君）门下的宾客邹文、季节两人交了朋友。后来孔穿要回鲁国了、邹、季两人上路相送，一直送了三天，陪着走了不少路，总是恋恋不舍。临别的时候，邹文、季节竟难过得流下眼泪，而孔穿只躬身向他俩轻轻一揖，就转身而去。与孔穿同行的人不理解他为什么如此不近人情。孔穿说：起初我以为他们都是大丈夫，想不到这两个人却如此婆婆妈妈，“人生则有四方之志”，怎么能儿女情长、长期聚在一起呢？",
        "character": [
            "孔穿",
            "邹文",
            "季节"
        ]
    },
    {
        "idiom": "折冲樽俎",
        "pingyin": "zhé chōng zūn zǔ",
        "explanation": "后泛指在外交谈判上克敌制胜",
        "source": "《战国策·齐五策》",
        "memo": "《战国策·齐五策》苏秦说齐闵王曰：“臣之所闻，攻战之道非师者，虽有百万之军，北之堂上；虽有阖闾、吴起之将，擒之户内；千丈之城，拔之尊俎之间；百尺之冲，折之衽席之上。”",
        "story": "”春秋时期，中原的强国晋国谋划攻打齐国，为了探清齐国形势，晋平公派大夫范昭出使齐国。齐景公盛宴款待范昭。席间，正值酒酣耳热，大家都有些醉，范昭借着酒劲儿向齐景公说：“大王，请您给我一杯酒喝吧。”齐景公对左右的人说：“把酒倒在寡人的酒杯里拿去。”范昭接过一饮而尽。晏婴看到后，厉声命令侍臣道：“快扔掉这个酒杯，给大王再换一个。”依照当时的礼节，在酒席上，君臣各用各的酒杯。范昭故意违反礼节就是要试探齐国君臣的反应，但被晏婴识破了。范昭回国后向晋平公报告：“现在还不是攻打齐国的最佳时机，我试探了齐国君臣的反应，结果让晏婴识破了。”范昭认为齐国有这样的贤臣，这样去打，绝对没有必胜的把握。”",
        "character": [
            "范昭",
            "齐景公",
            "晏婴"
        ]
    },
    {
        "idiom": "中流砥柱",
        "pingyin": "zhōng liú dǐ zhù",
        "explanation": "比喻坚强独立的人能在动荡艰难的环境中起支柱作用。",
        "source": "《晏子春秋·内篇谏下》",
        "memo": "《晏子春秋·内篇谏下》：“吾尝从君济于河，鼋衔左骖，以入砥柱之中流。”",
        "story": "上古时代，黄河三门峡河道狭窄处有一座山矗立在黄河的急流中，影响河水的通行，大禹治水时把两边的河道凿宽，这样这座砥柱山就像一根柱子一样立在急流之中。三门峡分人门、神门及鬼门，其中鬼门最险，而砥柱却巍然屹立在急流中。",
        "character": [
            "大禹"
        ]
    },
    {
        "idiom": "诛不避贵",
        "pingyin": "zhū bú bì guì",
        "explanation": "惩治罪人没躲避富贵的人。形容法制之下不分贵贱。",
        "source": "《晏子春秋·内篇问上》",
        "memo": "《晏子春秋·内篇问上》：“诛不避贵，赏不遗贱；不淫于乐，不遁于哀；尽智导民，而不伐焉，劳力岁事，而不责焉。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "斫轮老手",
        "pingyin": "zhuó lún láo shǒu",
        "explanation": "指对某种事情经验丰富的人。",
        "source": "《庄子·天道》",
        "memo": "《庄子·天道》：“是以行年七十而老斫轮。”",
        "story": "齐桓公在堂上读书，轮扁在堂下砍削木材制作车轮，轮扁放下椎凿的工具走上堂来，问齐桓公说：“请问，公所读的是什么书呀？”桓公说：“是记载圣人之言的书。” 又问：“圣人还在吗？” 桓公说：“已经死去了。”轮扁说：“那么您所读的书不过是圣人留下的糟粕罢了。”桓公很生气的说：“我读书，你一个做轮子的匠人怎么能议论？说出道理就可以放过你，没有道理可说就要处死你。”轮扁说：“我是从我做的事情看出来的。砍削木材制作轮子，榫头做得过于宽缓，就会松动而不牢固，做得太紧了，又会滞涩而难以进入。我却能够做得不宽不紧，得心应手，口里说不出来其中的奥妙，但其中自有度数分寸在。我不能明白地告诉我的儿子，我儿子也不能从我这里得到做轮子的经验和方法，所以我已七十岁了，还在独自做车轮。古代人和他们所不能言传的东西都已一起死去了，所以您读的所谓圣人之书就只不过是古人留下的糟粕罢了！”",
        "character": [
            "齐桓公",
            "轮扁"
        ]
    },
    {
        "idiom": "自荐枕席",
        "pingyin": "zì jiàn zhěn xí",
        "explanation": "一般都是女方的谦词，和以身相许相近。",
        "source": "《高唐赋》",
        "memo": "战国楚宋玉《高唐赋》有：“昔者先王尝游高唐，怠而昼寝，梦见一妇人，曰：‘妾，巫山之女也，为高唐之客，闻君游高唐，原荐枕席。’王因幸之。去而辞曰：‘妾在巫山之阳，高丘之阴，旦为朝云，暮为行雨，朝朝暮暮，阳台之下。’”",
        "story": "齐宣王之后钟无艳，又名钟离春、钟无颜。复姓钟离名无盐（一说名春，字无盐），因相貌奇丑，后人称为无艳。钟离春虽然长了一副让人吃惊的模样，但她志向远大。齐宣王执政初期，日日歌舞，夜夜欢声，政治腐败，国事昏暗，而且性情暴躁，喜欢吹捧.钟离春为拯救国民，冒死自请见齐宣王，述先人开疆不易，历数宣王之错。陈述齐国危难四条，并指出如再不悬崖勒马，将会城破国亡。齐宣王大为感动，把钟离春看成是自己的一面宝镜，其谏议为宣王所采纳。为表其悔改之心，散尽后宫，立无艳为后，彰其不贪美貌，自此勤政改革，齐国成为六国之佼佼者，从此国大治！而中国也留下两句成语“丑胜无盐”和“自荐枕席”。",
        "character": [
            "无盐",
            "齐宣王"
        ]
    },
    {
        "idiom": "子虚乌有",
        "pingyin": "zǐ xū wū yǒu",
        "explanation": "指假设的、不存在的、不真实的事情。",
        "source": "《史记·司马相如列传》",
        "memo": "《史记·司马相如列传》：“相如以子虚，虚言也，为楚称。乌有先生者，乌有此事也，为齐难。亡是公者，无是人也，明天子之义。故空藉此三人为辞，以推天子诸侯之苑囿，其卒章归之于节俭，因以风谏。”",
        "story": "",
        "character": []
    },
    {
        "idiom": "坐以待毙",
        "pingyin": "zuò yǐ dài bì",
        "explanation": "形容在极端困难中，不积极想办法找出路。",
        "source": "《管子·参患》",
        "memo": "先秦·管仲《管子·参患》：“短兵待远矢，与坐而待死者同实。”",
        "story": "",
        "character": []
    }
]